[{
  "tag": "P",
  "text": "If you agree with this article and want the US Government to take action, please sign the White House petition to implement a Hammer-and-Dance Suppression strategy.",
  "translation": "如果您同意本文并希望美国政府采取行动，请签署白宫请愿书以实施“制止和打击舞弊”战略。"
}, {
  "tag": "H2",
  "text": "Buy Us Time to Fight the Coronavirus and Save Millions of Lives with a Hammer-and-Dance Suppression…",
  "translation": "为我们争取时间与冠状病毒进行战斗，并通过锤子和舞蹈抑制器挽救数百万人的生命……"
}, {
  "tag": "H3",
  "text": "Our healthcare system is collapsing. It will only get worse. Mitigation-\"flattening the curve\"-isn't enough. We must…",
  "translation": "我们的医疗保健系统正在崩溃。 只会变得更糟。 缓解（“使曲线变平”）还不够。 我们必须…"
}, {
  "tag": "P",
  "text": "If you are an expert in the field and want to criticize or endorse the article or some of its parts, feel free to leave a private note here or contextually and I will respond or address.",
  "translation": "如果您是该领域的专家，并且想批评或认可这篇文章或其中的某些部分，请随时在此处或上下文中留下私人注释，我将予以答复或解决。"
}, {
  "tag": "P",
  "text": "If you want to translate this article, do it on a Medium post and leave me a private note here with your link. Here are the translations currently available:",
  "translation": "如果您想翻译这篇文章，请在中型帖子上进行翻译，并在此处给我一个私人注释，并提供链接。 以下是当前可用的翻译："
}, {
  "tag": "P",
  "text": "FrenchChinese (Traditional)GermanVietnamese",
  "translation": "法文中文（繁体）德文越南文"
}, {
  "tag": "P",
  "text": "This article has been the result of a herculean effort by a group of normal citizens working around the clock to find all the relevant research available to structure it into one piece, in case it can help others process all the information that is out there about the coronavirus.",
  "translation": "本文是一群全天候工作的普通市民辛勤工作的结果，目的是找到所有可用的相关研究，以将其整理成一份，以防它可以帮助其他人处理有关该物品的所有信息。 冠状病毒。"
}, {
  "tag": "P",
  "text": "Special thanks to Dr. Carl Juneau (epidemiology), Dr. Brandon Fainstad, Pierre Djian, Jorge Peñalva, John Hsu, Genevieve Gee, Elena Baillie, Chris Martinez, Yasemin Denari, Christine Gibson, Matt Bell, Dan Walsh, Jessica Thompson, Karim Ravji, Annie Hazlehurst, and Aishwarya Khanduja. This has been a team effort.",
  "translation": "特别感谢卡尔朱诺博士（流行病学），布兰登·法恩斯塔德博士，皮埃尔·德坚，皮尔·阿尔瓦，约翰·许，Genevieve Gee，埃琳娜·贝利，克里斯·马丁内斯，亚瑟敏·德纳里，克里斯蒂娜·吉布森，马特·贝尔，丹·沃尔什，杰西卡·汤普森，卡里姆 Ravji，Annie Hazlehurst和Aishwarya Khanduja。 这是团队的努力。"
}, {
  "tag": "P",
  "text": "Thank you also to Berin Szoka, Shishir Mehrotra, QVentus, Illumina, Josephine Gavignet, Mike Kidd, and Nils Barth for your advice. Thank you to my company, Course Hero, for giving me the time and freedom to focus on this.",
  "translation": "也感谢Berin Szoka，Shishir Mehrotra，QVentus，Illumina，Josephine Gavignet，Mike Kidd和Nils Barth的建议。 感谢我的公司Course Course，让我有时间和自由地专注于此。"
}, {
  "tag": "H1",
  "text": "Coronavirus: The Hammer and the Dance",
  "translation": "冠状病毒：锤子和舞蹈"
}, {
  "tag": "H2",
  "text": "What the Next 18 Months Can Look Like, if Leaders Buy Us Time",
  "translation": "如果领导者给我们时间，接下来的18个月会是什么样子"
}, {
  "tag": "P",
  "text": "This article follows Coronavirus: Why You Must Act Now, an article with over 40 million views translated into over 20 languages describing the urgency of the Coronavirus problem. If you agree with this article, consider signing the corresponding White House petition. Translations available in 4 languages at the bottom.",
  "translation": "本文遵循冠状病毒：为什么必须立即采取行动，这篇文章将4000万浏览量翻译成20多种语言，描述了冠状病毒问题的紧迫性。 如果您同意本文，请考虑签署相应的白宫请愿书。 底部提供4种语言的翻译版本。"
}, {
  "tag": "P",
  "text": "Summary of the article: Strong coronavirus measures today should only last a few weeks, there shouldn’t be a big peak of infections afterwards, and it can all be done for a reasonable cost to society, saving millions of lives along the way. If we don’t take these measures, tens of millions will be infected, many will die, along with anybody else that requires intensive care, because the healthcare system will have collapsed.",
  "translation": "文章摘要：如今，强有力的冠状病毒措施只能持续数周，此后不应再出现很大的感染高峰，并且所有这些都可以为社会付出合理的代价，从而挽救数百万人的生命。 如果我们不采取这些措施，由于医疗保健系统将崩溃，数以千万计的人将被感染，许多人将与其他需要重症监护的人一起死亡。"
}, {
  "tag": "P",
  "text": "Within a week, countries around the world have gone from: “This coronavirus thing is not a big deal” to declaring the state of emergency. Yet many countries are still not doing much. Why?",
  "translation": "一周之内，世界各地的国家已经从：“这件冠状病毒事关大事”变成了宣布紧急状态。 然而，许多国家仍然没有做很多事情。 为什么？"
}, {
  "tag": "P",
  "text": "Every country is asking the same question: How should we respond? The answer is not obvious to them.",
  "translation": "每个国家都在问同样的问题：我们应该如何回应？ 答案对他们而言并不明显。"
}, {
  "tag": "P",
  "text": "Some countries, like France, Spain or Philippines, have since ordered heavy lockdowns. Others, like the US, UK, Switzerland or Netherlands, have dragged their feet, hesitantly venturing into social distancing measures.",
  "translation": "此后，法国，西班牙或菲律宾等一些国家已下令严厉封锁。 美国，英国，瑞士或荷兰等其他国家则拖延了脚步，不愿冒险采取社会疏远措施。"
}, {
  "tag": "P",
  "text": "Here’s what we’re going to cover today, again with lots of charts, data and models with plenty of sources:",
  "translation": "这是我们今天要讨论的内容，再次提供了许多图表，数据和具有大量来源的模型："
}, {
  "tag": "OL",
  "texts": ["What’s the current situation?", "What options do we have?", "What’s the one thing that matters now: Time", "What does a good coronavirus strategy look like?", "How should we think about the economic and social impacts?"],
  "translations": ["目前情况如何？", "我们有什么选择？", "现在最重要的一件事是：时间", "一个好的冠状病毒策略是什么样的？", "我们应如何考虑经济和社会影响？"]
}, {
  "tag": "P",
  "text": "When you’re done reading the article, this is what you’ll take away:",
  "translation": "阅读完本文后，您将获得以下内容："
}, {
  "tag": "P",
  "text": "Our healthcare system is already collapsing.Countries have two options: either they fight it hard now, or they will suffer a massive epidemic.If they choose the epidemic, hundreds of thousands will die. In some countries, millions.And that might not even eliminate further waves of infections.If we fight hard now, we will curb the deaths.We will relieve our healthcare system.We will prepare better.We will learn.The world has never learned as fast about anything, ever.And we need it, because we know so little about this virus.All of this will achieve something critical: Buy Us Time.",
  "translation": "我们的医疗体系已经崩溃了，国家有两种选择：要么现在就在与之抗争，要么将遭受大规模的流行病;如果选择这种流行病，数十万人将丧生。 在一些国家，数以百万计的人甚至可能无法消除进一步的感染浪潮。如果我们现在努力奋斗，我们将遏制死亡，我们将减轻我们的医疗保健系统，我们将做得更好，我们将学习，世界从未学到 我们需要它，因为我们对该病毒知之甚少。所有这些都将实现至关重要的事情：为我们争取时间。"
}, {
  "tag": "P",
  "text": "If we choose to fight hard, the fight will be sudden, then gradual.We will be locked in for weeks, not months.Then, we will get more and more freedoms back.It might not be back to normal immediately. But it will be close, and eventually back to normal.And we can do all that while considering the rest of the economy too.",
  "translation": "如果我们选择艰苦奋斗，那么斗争将是突然的，然后是渐进的。我们将被锁定数周而不是几个月，然后，我们将获得越来越多的自由，这可能不会立即恢复正常。 但这将很快结束，并最终恢复正常。我们也可以在考虑经济其他方面的同时做到这一点。"
}, {
  "tag": "P",
  "text": "Ok, let’s do this.",
  "translation": "好吧，让我们这样做。"
}, {
  "tag": "H1",
  "text": "1. What’s the situation?",
  "translation": "1.情况如何？"
}, {
  "tag": "P",
  "text": "Last week, I showed this curve:",
  "translation": "上周，我显示了此曲线："
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/0*hzc0jdBbibZAdOYY?q=20",
  "type": "image",
  "file": "0!hzc0jdBbibZAdOYY"
}, {
  "tag": "P",
  "text": "It showed coronavirus cases across the world outside of China. We could only discern Italy, Iran and South Korea. So I had to zoom in on the bottom right corner to see the emerging countries. My entire point is that they would soon be joining these 3 cases.",
  "translation": "它显示了中国以外世界各地的冠状病毒病例。 我们只能看到意大利，伊朗和韩国。 因此，我必须放大右下角才能看到新兴国家。 我的意思是，他们很快将加入这3个案例。"
}, {
  "tag": "P",
  "text": "Let’s see what has happened since.",
  "translation": "让我们看看发生了什么。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/0*uJOmcUP5ydKXxwwj?q=20",
  "type": "image",
  "file": "0!uJOmcUP5ydKXxwwj"
}, {
  "tag": "P",
  "text": "As predicted, the number of cases has exploded in dozens of countries. Here, I was forced to show only countries with over 1,000 cases. A few things to note:",
  "translation": "如预测的那样，在数十个国家中病例数激增。 在这里，我被迫只展示有1000多个案例的国家。 注意事项："
}, {
  "tag": "UL",
  "texts": ["Spain, Germany, France and the US all have more cases than Italy when it ordered the lockdown", "An additional 16 countries have more cases today than Hubei when it went under lockdown: Japan, Malaysia, Canada, Portugal, Australia, Czechia, Brazil and Qatar have more than Hubei but below 1,000 cases. Switzerland, Sweden, Norway, Austria, Belgium, Netherlands and Denmark all have above 1,000 cases."],
  "translations": ["西班牙，德国，法国和美国下令封锁的案件均比意大利多", "如今，受封锁的国家比湖北还多，有16个国家：日本，马来西亚，加拿大，葡萄牙，澳大利亚，捷克，巴西和卡塔尔的案件多于湖北，但不到1000个。 瑞士，瑞典，挪威，奥地利，比利时，荷兰和丹麦的案件均超过1,000起。"]
}, {
  "tag": "P",
  "text": "Do you notice something weird about this list of countries? Outside of China and Iran, which have suffered massive, undeniable outbreaks, and Brazil and Malaysia, every single country in this list is among the wealthiest in the world.",
  "translation": "您是否注意到这个国家/地区列表有些奇怪？ 在遭受大规模，不可否认爆发的中国和伊朗以及巴西和马来西亚之外，该名单中的每个国家都是世界上最富有的国家之一。"
}, {
  "tag": "P",
  "text": "Do you think this virus targets rich countries? Or is it more likely that rich countries are better able to identify the virus?",
  "translation": "您认为这种病毒针对富裕国家吗？ 还是富裕国家更有可能更好地识别该病毒？"
}, {
  "tag": "P",
  "text": "It’s unlikely that poorer countries aren’t touched. Warm and humid weather probably helps, but doesn’t prevent an outbreak by itself — otherwise Singapore, Malaysia or Brazil wouldn’t be suffering outbreaks.",
  "translation": "较贫穷的国家不太可能不会受到影响。 温暖潮湿的天气可能有所帮助，但并不能阻止爆发本身，否则新加坡，马来西亚或巴西就不会遭受爆发。"
}, {
  "tag": "P",
  "text": "The most likely interpretations are that the coronavirus either took longer to reach these countries because they’re less connected, or it’s already there but these countries haven’t been able to invest enough on testing to know.",
  "translation": "最可能的解释是，冠状病毒可能需要较长的时间才能到达这些国家，因为它们之间的联系较少，或者已经存在，但是这些国家没有足够的投资来进行检测。"
}, {
  "tag": "P",
  "text": "Either way, if this is true, it means that most countries won’t escape the coronavirus. It’s a matter of time before they see outbreaks and need to take measures.",
  "translation": "无论哪种方式，如果这是事实，那就意味着大多数国家都不会逃脱冠状病毒。 他们看到爆发并需要采取措施只是时间问题。"
}, {
  "tag": "P",
  "text": "What measures can different countries take?",
  "translation": "不同国家可以采取哪些措施？"
}, {
  "tag": "H1",
  "text": "2. What Are Our Options?",
  "translation": "2.我们有什么选择？"
}, {
  "tag": "P",
  "text": "Since the article last week, the conversation has changed and many countries have taken measures. Here are some of the most illustrative examples:",
  "translation": "自上周发表文章以来，对话已发生变化，许多国家已采取措施。 以下是一些最具说明性的示例："
}, {
  "tag": "H2",
  "text": "Measures in Spain and France",
  "translation": "西班牙和法国的措施"
}, {
  "tag": "P",
  "text": "In one extreme, we have Spain and France. This is the timeline of measures for Spain:",
  "translation": "在一个极端中，我们有西班牙和法国。 这是西班牙采取措施的时间表："
}, {
  "tag": "P",
  "text": "On Thursday, 3/12, the President dismissed suggestions that the Spanish authorities had been underestimating the health threat.On Friday, they declared the State of Emergency.On Saturday, measures were taken:",
  "translation": "3/12星期四，总统驳回了有关西班牙当局一直低估健康威胁的建议。星期五，他们宣布进入紧急状态。星期六，采取了以下措施："
}, {
  "tag": "UL",
  "texts": ["People can’t leave home except for key reasons: groceries, work, pharmacy, hospital, bank or insurance company (extreme justification)", "Specific ban on taking kids out for a walk or seeing friends or family (except to take care of people who need help, but with hygiene and physical distance measures)", "All bars and restaurants closed. Only take-home acceptable.", "All entertainment closed: sports, movies, museums, municipal celebrations…", "Weddings can’t have guests. Funerals can’t have more than a handful of people.", "Mass transit remains open"],
  "translations": ["人们不能离开家，除非有以下关键原因：杂货，工作，药房，医院，银行或保险公司（极端理由）", "明确禁止带孩子出去散步或去见朋友或家人（除了照顾需要帮助的人，但要有卫生和身体上的距离措施）", "所有酒吧和餐馆都关闭了。 只能带回家。", "所有娱乐场所关闭：体育，电影，博物馆，市政庆典...", "婚礼不能有客人。 丧葬人数不能超过几个。", "大众运输仍然开放"]
}, {
  "tag": "P",
  "text": "On Monday, land borders were shut.",
  "translation": "星期一，陆地边界被关闭。"
}, {
  "tag": "P",
  "text": "Some people see this as a great list of measures. Others put their hands up in the air and cry of despair. This difference is what this article will try to reconcile.",
  "translation": "有人认为这是一个很好的措施清单。 其他人则举起双手，绝望地哭泣。 本文将尝试解决这种差异。"
}, {
  "tag": "P",
  "text": "France’s timeline of measures is similar, except they took more time to apply them, and they are more aggressive now. For example, rent, taxes and utilities are suspended for small businesses.",
  "translation": "法国的措施时间表很相似，只是法国花费了更多的时间来实施这些措施，而且它们现在更具侵略性。 例如，小型企业的租金，税金和公用事业被暂停。"
}, {
  "tag": "H2",
  "text": "Measures in the US and UK",
  "translation": "美国和英国的措施"
}, {
  "tag": "P",
  "text": "The US and UK, like countries such as Switzerland or Netherlands, have dragged their feet in implementing measures. Here’s the timeline for the US:",
  "translation": "美国和英国像瑞士或荷兰等国家一样，在实施措施方面也拖延了脚步。 这是美国的时间表："
}, {
  "tag": "UL",
  "texts": ["Wednesday 3/11: travel ban.", "Friday: National Emergency declared. No social distancing measures", "Monday: the government urges the public to avoid restaurants or bars and attend events with more than 10 people. No social distancing measure is actually enforceable. It’s just a suggestion."],
  "translations": ["3/11星期三：旅行禁令。", "星期五：宣布国家紧急状态。 没有社会疏远措施", "星期一：政府敦促公众避开餐厅或酒吧，并参加超过10人的活动。 实际上，没有任何社会疏远措施可以执行。 这只是一个建议。"]
}, {
  "tag": "P",
  "text": "Lots of states and cities are taking the initiative and mandating much stricter measures.",
  "translation": "许多州和城市正在采取主动行动，并要求采取更为严格的措施。"
}, {
  "tag": "P",
  "text": "The UK has seen a similar set of measures: lots of recommendations, but very few mandates.",
  "translation": "英国也看到了一系列类似的措施：很多建议，但授权却很少。"
}, {
  "tag": "P",
  "text": "These two groups of countries illustrate the two extreme approaches to fight the coronavirus: mitigation and suppression. Let’s understand what they mean.",
  "translation": "这两类国家说明了与冠状病毒作斗争的两种极端方法：缓解和抑制。 让我们了解它们的意思。"
}, {
  "tag": "H2",
  "text": "Option 1: Do Nothing",
  "translation": "选项1：什么都不做"
}, {
  "tag": "P",
  "text": "Before we do that, let’s see what doing nothing would entail for a country like the US:",
  "translation": "在此之前，让我们来看看对像美国这样的国家不采取任何行动是什么："
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*TO2056gWgab1vnkHLIACkA.png?q=20",
  "caption": "This fantastic epidemic calculator can help you understand what will happen under different scenarios. I’ve pasted below the graph the key factors that determine the behavior of the virus. Note that infected, in pink, peak in the tens of millions at a certain date. Most variables have been kept from the default. The only material changes are R from 2.2 to 2.4 (corresponds better to currently available information. See at the bottom of the epidemic calculator), fatality rate (4% due to healthcare system collapse. See details below or in the previous article), length of hospital stay (down from 20 to 10 days) and hospitalization rate (down from 20% to 14% based on severe and critical cases. Note the WHO calls out a 20% rate) based on our most recently available gathering of research. Note that these numbers don’t change results much. The only change that matters is the fatality rate.",
  "type": "image",
  "file": "1!TO2056gWgab1vnkHLIACkA.png"
}, {
  "tag": "P",
  "text": "If we do nothing: Everybody gets infected, the healthcare system gets overwhelmed, the mortality explodes, and ~10 million people die (blue bars). For the back-of-the-envelope numbers: if ~75% of Americans get infected and 4% die, that’s 10 million deaths, or around 25 times the number of US deaths in World War II.",
  "translation": "如果我们什么都不做：每个人都被感染，医疗保健系统将不堪重负，死亡率激增，约一千万人丧生（蓝色竖条）。 举个例子，如果大约75％的美国人被感染而4％的人死亡，那就是1000万人的死亡，大约是第二次世界大战中美国死亡人数的25倍。"
}, {
  "tag": "P",
  "text": "You might wonder: “That sounds like a lot. I’ve heard much less than that!”",
  "translation": "您可能会想：“这听起来很多。 我所听到的远不止于此！”"
}, {
  "tag": "P",
  "text": "So what’s the catch? With all these numbers, it’s easy to get confused. But there’s only two numbers that matter: What share of people will catch the virus and fall sick, and what share of them will die. If only 25% are sick (because the others have the virus but don’t have symptoms so aren’t counted as cases), and the fatality rate is 0.6% instead of 4%, you end up with 500k deaths in the US. Still massive. But 20 times less than above.",
  "translation": "那么有什么收获呢？ 有了这些数字，您很容易感到困惑。 但是只有两个数字很重要：感染病毒并患病的人数比例以及死亡人数。 如果只有25％患病（因为其他人患有病毒，但没有症状，因此不算作病例），并且死亡率是0.6％而不是4％，那么在美国您将有50万人死亡。 仍然庞大。 但是比上面少20倍。"
}, {
  "tag": "P",
  "text": "The fatality rate is crucial, so let’s understand it better. What really causes the coronavirus deaths?",
  "translation": "死亡率是至关重要的，所以让我们更好地了解它。 什么真正导致冠状病毒死亡？"
}, {
  "tag": "H2",
  "text": "How Should We Think about the Fatality Rate?",
  "translation": "我们应该如何考虑死亡率？"
}, {
  "tag": "P",
  "text": "This is the same graph as before, but now looking at hospitalized people instead of infected and dead:",
  "translation": "这是与以前相同的图表，但是现在查看的是住院患者，而不是感染者和死亡者："
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*4mHOwfGO8YXK9UOmWFJhQw.png?q=20",
  "type": "image",
  "file": "1!4mHOwfGO8YXK9UOmWFJhQw.png"
}, {
  "tag": "P",
  "text": "The light blue area is the number of people who would need to go to the hospital, and the darker blue represents those who need to go to the intensive care unit (ICU). You can see that number would peak at above 3 million.",
  "translation": "浅蓝色区域表示需要去医院的人数，深蓝色区域表示需要去重症监护病房（ICU）的人数。 您可以看到该数字将达到300万以上的峰值。"
}, {
  "tag": "P",
  "text": "Now compare that to the number of ICU beds we have in the US (50k today, we could double that repurposing other space). That’s the red dotted line.",
  "translation": "现在，将其与我们在美国拥有的ICU床数量进行比较（今天为5万张，我们可以将其用于其他空间的数量增加一倍）。 那是红色的虚线。"
}, {
  "tag": "P",
  "text": "No, that’s not an error.",
  "translation": "不，那不是错误。"
}, {
  "tag": "P",
  "text": "That red dotted line is the capacity we have of ICU beds. Everyone above that line would be in critical condition but wouldn’t be able to access the care they need, and would likely die.",
  "translation": "红色虚线表示我们拥有ICU病床的容量。 该线以上的每个人都处于危急状态，但将无法获得他们所需的护理，甚至可能死亡。"
}, {
  "tag": "P",
  "text": "Instead of ICU beds you can also look at ventilators, but the result is broadly the same, since there are fewer than 100k ventilators in the US.",
  "translation": "除了ICU床外，您还可以查看呼吸机，但结果大致相同，因为美国的呼吸机少于10万。"
}, {
  "tag": "P",
  "text": "As of today, at least one Seattle hospital is unable to intubate patients over 65 due to shortages of equipment and gives them a 90% chance of dying.",
  "translation": "截止到今天，至少有一家西雅图医院由于设备短缺而无法为65岁以上的患者插管，并使他们有90％的死亡机会。"
}, {
  "tag": "P",
  "text": "This is why people died in droves in Hubei and are now dying in droves in Italy and Iran. The Hubei fatality rate ended up better than it could have been because they built 2 hospitals nearly overnight. Italy and Iran can’t do the same; few, if any, other countries can. We’ll see what ends up happening there.",
  "translation": "这就是为什么人们在湖北成群结队死亡，而现在在意大利和伊朗成群结队死亡的原因。 湖北的病死率最终好于预期，因为他们几乎在一夜之间建立了两家医院。 意大利和伊朗无法做到这一点； 很少有其他国家能做到的。 我们将在那里看到最终的结果。"
}, {
  "tag": "P",
  "text": "So why is the fatality rate close to 4%?",
  "translation": "那么为什么病死率接近4％呢？"
}, {
  "tag": "P",
  "text": "If 5% of your cases require intensive care and you can’t provide it, most of those people die. As simple as that.",
  "translation": "如果您的病例中有5％需要重症监护而您无法提供，那么大多数人会丧生。 就如此容易。"
}, {
  "tag": "P",
  "text": "Additionally, recent data suggests that US cases are more severe than in China. I wish that was it, but it isn’t.",
  "translation": "此外，最近的数据表明，美国的案件比中国的案件更为严重。 我希望就是这样，但事实并非如此。"
}, {
  "tag": "H2",
  "text": "Collateral Damage",
  "translation": "附带损害"
}, {
  "tag": "P",
  "text": "These numbers only show people dying from coronavirus. But what happens if all your healthcare system is collapsed by coronavirus patients? Others also die from other ailments.",
  "translation": "这些数字仅显示死于冠状病毒的人。 但是，如果冠状病毒患者使您的所有医疗系统崩溃，会发生什么？ 其他人也因其他疾病而死亡。"
}, {
  "tag": "P",
  "text": "What happens if you have a heart attack but the ambulance takes 50 minutes to come instead of 8 (too many coronavirus cases) and once you arrive, there’s no ICU and no doctor available? You die.",
  "translation": "如果您有心脏病发作，但救护车只需50分钟即可到达，而不是8分钟（冠状病毒病例过多），怎么办？一旦到达，就没有ICU，也没有医生可用？ 你完蛋了。"
}, {
  "tag": "P",
  "text": "There are 4 million admissions to the ICU in the US every year, and 500k (~13%) of them die. Without ICU beds, that share would likely go much closer to 80%. Even if only 50% died, in a year-long epidemic you go from 500k deaths a year to 2M, so you’re adding 1.5M deaths, just with collateral damage.",
  "translation": "在美国，每年有400万人进入ICU，其中有50万人（〜13％）死亡。 如果没有ICU病床，该份额可能会接近80％。 即使只有50％的人死亡，在一年的流行病中，每年的死亡人数也从50万增加到200万，因此，加上附带损害，您的死亡人数就增加了150万。"
}, {
  "tag": "P",
  "text": "If the coronavirus is left to spread, the US healthcare system will collapse, and the deaths will be in the millions, maybe more than 10 million.",
  "translation": "如果冠状病毒继续传播，美国医疗体系将崩溃，死亡人数将达数百万，甚至超过一千万。"
}, {
  "tag": "P",
  "text": "The same thinking is true for most countries. The number of ICU beds and ventilators and healthcare workers are usually similar to the US or lower in most countries. Unbridled coronavirus means healthcare system collapse, and that means mass death.",
  "translation": "对于大多数国家来说，同样的想法是正确的。 ICU病床，呼吸机和医护人员的数量通常与美国相似，或者在大多数国家中较低。 无节制的冠状病毒意味着医疗系统崩溃，这意味着大规模死亡。"
}, {
  "tag": "P",
  "text": "Unbridled coronavirus means healthcare systems collapse, and that means mass death.",
  "translation": "无节制的冠状病毒意味着医疗系统崩溃，这意味着大规模死亡。"
}, {
  "tag": "H2",
  "text": "Option 2: Mitigation Strategy",
  "translation": "选项2：缓解策略"
}, {
  "tag": "P",
  "text": "By now, I hope it’s pretty clear we should act. The two options that we have are mitigation and suppression.",
  "translation": "到现在为止，我希望我们已明确采取行动。 我们拥有的两个选择是缓解和抑制。"
}, {
  "tag": "P",
  "text": "Mitigation goes like this: “It’s impossible to prevent the coronavirus now, so let’s just have it run its course, while trying to reduce the peak of infections. Let’s just flatten the curve a little bit to make it more manageable for the healthcare system.”",
  "translation": "缓解措施是这样的：“现在无法预防冠状病毒，所以就让它顺其自然，同时努力减少感染高峰。 让我们稍微弄平曲线，使其对医疗保健系统更易于管理。”"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/0*VOG5Nly8WNBycjeF?q=20",
  "type": "image",
  "file": "0!VOG5Nly8WNBycjeF"
}, {
  "tag": "P",
  "text": "This chart appears in a very important paper published over the weekend from the Imperial College London. Apparently, it pushed the UK and US governments to change course.",
  "translation": "该图表出现在伦敦帝国理工学院上周末发表的非常重要的论文中。 显然，这促使英国和美国政府改变了路线。"
}, {
  "tag": "P",
  "text": "It’s a very similar graph as the previous one. Not the same, but conceptually equivalent. Here, the “Do Nothing” situation is the black curve. Each one of the other curves are what would happen if we implemented tougher and tougher social distancing measures. The blue one shows the toughest social distancing measures: isolating infected people, quarantining people who might be infected, and secluding old people. This blue line is broadly the current UK coronavirus strategy, although for now they’re just suggesting it, not mandating it.",
  "translation": "与上一张非常相似。 不一样，但在概念上是等效的。 在这里，“什么都不做”的情况就是黑色曲线。 如果我们实施越来越严格的社会疏离措施，那么其他每条曲线都会发生。 蓝色的代表了最严厉的社会疏远措施：隔离感染者，隔离可能感染的人以及隔离老年人。 蓝线大致上是当前英国的冠状病毒策略，尽管目前他们只是在建议而不是强制执行。"
}, {
  "tag": "P",
  "text": "Here, again, the red line is the capacity for ICUs, this time in the UK. Again, that line is very close to the bottom. All that area of the curve on top of that red line represents coronavirus patients who would mostly die because of the lack of ICU resources.",
  "translation": "再次，红线是这一次在英国的ICU容量。 同样，那条线非常接近底部。 红线上方的所有曲线区域代表冠状病毒患者，这些患者大多会因缺乏ICU资源而死亡。"
}, {
  "tag": "P",
  "text": "Not only that, but by flattening the curve, the ICUs will collapse for months, increasing collateral damage.",
  "translation": "不仅如此，而且通过使曲线变平，ICU会塌陷数月，从而增加附带损害。"
}, {
  "tag": "P",
  "text": "You should be shocked. When you hear: “We’re going to do some mitigation” what you should really hear is: “We will knowingly overwhelm the healthcare system, driving the fatality rate up by a factor of 10x at least.”",
  "translation": "你应该感到震惊。 当您听到：“我们将采取一些缓解措施”时，您真正应该听到的是：“我们将故意压倒医疗保健系统，将病死率至少提高10倍。”"
}, {
  "tag": "P",
  "text": "You would imagine this is bad enough. But we’re not done yet. Because one of the key assumptions of this strategy is what’s called “Herd Immunity”.",
  "translation": "您会想象这已经够糟糕了。 但是我们还没有完成。 因为此策略的主要假设之一是所谓的“ Herd Immunity”。"
}, {
  "tag": "H2",
  "text": "Herd Immunity and Virus Mutation",
  "translation": "牛群免疫和病毒变异"
}, {
  "tag": "P",
  "text": "The idea is that all the people who are infected and then recover are now immune to the virus. This is at the core of this strategy: “Look, I know it’s going to be hard for some time, but once we’re done and a few million people die, the rest of us will be immune to it, so this virus will stop spreading and we’ll say goodbye to the coronavirus. Better do it at once and be done with it, because our alternative is to do social distancing for up to a year or risk having this peak happen later anyways.”",
  "translation": "这个想法是，所有被感染然后康复的人现在都对这种病毒免疫。 这是该策略的核心：“看，我知道这将在一段时间内变得困难，但是一旦我们完成工作，几百万人死亡，我们其余人将对此免疫，因此 停止传播，我们将告别冠状病毒。 最好一次完成并完成它，因为我们的替代方法是进行长达一年的社交疏远，否则就有可能在稍后发生此高峰的风险。”"
}, {
  "tag": "P",
  "text": "Except this assumes one thing: the virus doesn’t change too much. If it doesn’t change much, then lots of people do get immunity, and at some point the epidemic dies down",
  "translation": "除此之外，我们假设的是一件事：病毒的变化不会太大。 如果变化不大，那么很多人的确会获得免疫力，在某些时候，流行病会死亡"
}, {
  "tag": "P",
  "text": "How likely is this virus to mutate? It already has.",
  "translation": "这种病毒突变的可能性有多大？ 它已经有。"
}, {
  "tag": "P",
  "text": "China has already seen two strains of the virus: the S and the L. The S was focused in Hubei and deadlier, but the L was the one that spread through the world.",
  "translation": "中国已经发现了两种病毒：S和L。S集中在湖北和更致命的地方，但L是在世界范围内传播的。"
}, {
  "tag": "P",
  "text": "Not only that, but this virus continues to mutate.",
  "translation": "不仅如此，而且这种病毒还在继续变异。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/0*9Ggoj59CoRvLNjzH?q=20",
  "caption": "This graph represents the different mutations of the virus. You can see that the initial strains started in purple in China, but then they started mutating. The strains in Europe are mostly green and yellow families, while the US is seeing a different family in red. As more time passes, more of these strains will start appearing.",
  "type": "image",
  "file": "0!9Ggoj59CoRvLNjzH"
}, {
  "tag": "P",
  "text": "This should not be surprising: RNA-based viruses like the coronavirus or the flu tend to mutate around 100 times faster than DNA-based ones—although the coronavirus mutates more slowly than influenza viruses.",
  "translation": "这不足为奇：像冠状病毒或流感这样的基于RNA的病毒突变的速度往往比基于DNA的突变快约100倍-尽管冠状病毒的突变速度比流感病毒慢。"
}, {
  "tag": "P",
  "text": "Not only that, but the best way for this virus to mutate is to have millions of opportunities to do so, which is exactly what a mitigation strategy would provide: hundreds of millions of people infected.",
  "translation": "不仅如此，这种病毒变异的最佳方法是拥有数百万次的机会，这正是缓解策略所能提供的：数亿人被感染。"
}, {
  "tag": "P",
  "text": "That’s why you have to get a flu shot every year. Because there are so many flu strains, with new ones always evolving, the flu shot can never protect against all strains.",
  "translation": "因此，您每年都必须注射流感疫苗。 因为有太多的流感病毒株，而且总是有新的流感株出现，所以流感疫苗永远无法抵御所有的菌株。"
}, {
  "tag": "P",
  "text": "Put in another way: the mitigation strategy not only assumes millions of deaths for a country like the US or the UK. It also gambles on the fact that the virus won’t mutate too much — which we know it does. And it will give it the opportunity to mutate. So once we’re done with a few million deaths, we could be ready for a few million more — every year. This corona virus could become a recurring fact of life, like the flu, but many times deadlier.",
  "translation": "换句话说，缓解策略不仅假设美国或英国这样的国家有数百万人死亡。 它也赌注事实是该病毒不会突变太多，而我们知道确实如此。 而且它将为它提供变异的机会。 因此，一旦我们完成了几百万人的死亡，我们可以为每年增加几百万人做好准备。 这种日冕病毒可能像流感一样成为生活中反复出现的事实，但致命性却高出许多倍。"
}, {
  "tag": "P",
  "text": "The best way for this virus to mutate is to have millions of opportunities to do so, which is exactly what a mitigation strategy would provide.",
  "translation": "这种病毒变异的最佳方法是拥有数百万的机会，这正是缓解策略所能提供的。"
}, {
  "tag": "P",
  "text": "So if neither doing nothing and mitigation will work, what’s the alternative? It’s called suppression.",
  "translation": "因此，如果什么都不做，缓解不起作用，那有什么选择呢？ 这就是抑制。"
}, {
  "tag": "H2",
  "text": "Option 3: Suppression Strategy",
  "translation": "选项3：抑制策略"
}, {
  "tag": "P",
  "text": "The Mitigation Strategy doesn’t try to contain the epidemic, just flatten the curve a bit. Meanwhile, the Suppression Strategy tries to apply heavy measures to quickly get the epidemic under control. Specifically:",
  "translation": "缓解策略并没有试图遏制这种流行病，只是使曲线变平了一点。 同时，“遏制战略”试图采取严厉措施，以迅速控制这一流行病。 特别："
}, {
  "tag": "UL",
  "texts": ["Go hard right now. Order heavy social distancing. Get this thing under control.", "Then, release the measures, so that people can gradually get back their freedoms and something approaching normal social and economic life can resume."],
  "translations": ["现在努力吧。 命令严重的社会疏远。 控制住这件事。", "然后，释放这些措施，使人们逐渐恢复自由，一些可以恢复正常的社会和经济生活的事物将得以恢复。"]
}, {
  "tag": "P",
  "text": "What does that look like?",
  "translation": "看起来像什么？"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*UeKXgacW7ruih10qYVYa5w.png?q=20",
  "caption": "All the model parameters are the same, except that there is an intervention around now to reduce the transmission rate to R=0.62, and because the healthcare system isn’t collapsed, the fatality rate goes down to 0.6%. I defined “around now” as having ~32,000 cases when implementing the measures (3x the official number as of today, 3/19). Note that this is not too sensitive to the R chosen. An R of 0.98 for example shows 15,000 deaths. Five times more than with an R of 0.62, but still tens of thousands of deaths and not millions. It’s also not too sensitive to the fatality rate: if it’s 0.7% instead of 0.6%, the death toll goes from 15,000 to 17,000. It’s the combination of a higher R, a higher fatality rate, and a delay in taking measures that explodes the number of fatalities. That’s why we need to take measures to reduce R today. For clarification, the famous R0 is R at the beginning (R at time 0). It’s the transmission rate when nobody is immune yet and there are no measures against it taken. R is the overall transmission rate.",
  "type": "image",
  "file": "1!UeKXgacW7ruih10qYVYa5w.png"
}, {
  "tag": "P",
  "text": "Under a suppression strategy, after the first wave is done, the death toll is in the thousands, and not in the millions.",
  "translation": "在压制策略下，第一波浪过后，死亡人数是数千，而不是数百。"
}, {
  "tag": "P",
  "text": "Why? Because not only do we cut the exponential growth of cases. We also cut the fatality rate since the healthcare system is not completely overwhelmed. Here, I used a fatality rate of 0.9%, around what we’re seeing in South Korea today, which has been most effective at following Suppression Strategy.",
  "translation": "为什么？ 因为我们不仅减少了案例的指数增长。 由于医疗保健系统并未完全淹没，因此我们也降低了死亡率。 在这里，我使用的死亡率是0.9％，大约是我们今天在韩国看到的死亡率，这在实施抑制策略时最有效。"
}, {
  "tag": "P",
  "text": "Said like this, it sounds like a no-brainer. Everybody should follow the Suppression Strategy.",
  "translation": "这样说，听起来很容易。 每个人都应遵循抑制策略。"
}, {
  "tag": "P",
  "text": "So why do some governments hesitate?",
  "translation": "那么为什么有些政府会犹豫呢？"
}, {
  "tag": "P",
  "text": "They fear three things:",
  "translation": "他们担心三件事："
}, {
  "tag": "OL",
  "texts": ["This first lockdown will last for months, which seems unacceptable for many people.", "A months-long lockdown would destroy the economy.", "It wouldn’t even solve the problem, because we would be just postponing the epidemic: later on, once we release the social distancing measures, people will still get infected in the millions and die."],
  "translations": ["第一次锁定将持续数月，这对于许多人来说似乎是无法接受的。", "长达数月的封锁将破坏经济。", "它甚至无法解决问题，因为我们只是将这一流行病推迟了：稍后，一旦我们发布社会疏离措施，人们仍然会被成千上万的人感染并死亡。"]
}, {
  "tag": "P",
  "text": "Here is how the Imperial College team modeled suppressions. The green and yellow lines are different scenarios of Suppression. You can see that doesn’t look good: We still get huge peaks, so why bother?",
  "translation": "帝国理工学院的团队是如何对镇压进行建模的。 绿线和黄线是不同的抑制方案。 您会发现这种情况看起来并不好：我们仍然会遇到巨大的高峰，那为什么还要麻烦呢？"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/0*4vEeRaGrvSP4xm85?q=20",
  "type": "image",
  "file": "0!4vEeRaGrvSP4xm85"
}, {
  "tag": "P",
  "text": "We’ll get to these questions in a moment, but there’s something more important before.",
  "translation": "我们稍后会解决这些问题，但之前还有一些更重要的事情。"
}, {
  "tag": "P",
  "text": "This is completely missing the point.",
  "translation": "这完全没有意义。"
}, {
  "tag": "P",
  "text": "Presented like these, the two options of Mitigation and Suppression, side by side, don’t look very appealing. Either a lot of people die soon and we don’t hurt the economy today, or we hurt the economy today, just to postpone the deaths.",
  "translation": "像这样呈现，缓解和抑制这两个选项并排看起来并不吸引人。 要么很多人很快就死了，我们今天不伤害经济，或者我们今天伤害了经济，只是为了推迟死亡。"
}, {
  "tag": "P",
  "text": "This ignores the value of time.",
  "translation": "这忽略了时间的价值。"
}, {
  "tag": "H1",
  "text": "3. The Value of Time",
  "translation": "3.时间的价值"
}, {
  "tag": "P",
  "text": "In our previous post, we explained the value of time in saving lives. Every day, every hour we waited to take measures, this exponential threat continued spreading. We saw how a single day could reduce the total cases by 40% and the death toll by even more.",
  "translation": "在上一篇文章中，我们解释了挽救生命的时间价值。 每天，我们等待采取措施的每一小时，这种指数威胁都在继续蔓延。 我们看到了一天如何可以将总病例减少40％，将死亡人数减少更多。"
}, {
  "tag": "P",
  "text": "But time is even more valuable than that.",
  "translation": "但是时间比那更有价值。"
}, {
  "tag": "P",
  "text": "We’re about to face the biggest wave of pressure on the healthcare system ever seen in history. We are completely unprepared, facing an enemy we don’t know. That is not a good position for war.",
  "translation": "我们将面临有史以来医疗体系面临的最大压力。 我们完全没有准备，面对一个我们不认识的敌人。 那不是战争的好位置。"
}, {
  "tag": "P",
  "text": "What if you were about to face your worst enemy, of which you knew very little, and you had two options: Either you run towards it, or you escape to buy yourself a bit of time to prepare. Which one would you choose?",
  "translation": "如果您将要面对最大的敌人，而您对此知之甚少，并且有两种选择，该怎么办：要么朝着它奔跑，要么逃避为自己腾出一点时间做准备。 你会选哪一个？"
}, {
  "tag": "P",
  "text": "This is what we need to do today. The world has awakened. Every single day we delay the coronavirus, we can get better prepared. The next sections detail what that time would buy us:",
  "translation": "这就是我们今天要做的。 世界已经觉醒。 每一天，我们延迟冠状病毒，我们都可以做得更好。 接下来的部分详细说明了当时的购买力："
}, {
  "tag": "H2",
  "text": "Lower the Number of Cases",
  "translation": "减少案件数量"
}, {
  "tag": "P",
  "text": "With effective suppression, the number of true cases would plummet overnight, as we saw in Hubei last week.",
  "translation": "如我们上周在湖北看到的那样，有了有效的制止，真实病例的数量将在一夜之间暴跌。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/0*-BJlxK_X6Qhhrt11?q=20",
  "caption": "Source: Tomas Pueyo analysis over chart and data from the Journal of the American Medical Association",
  "type": "image",
  "file": "0!-BJlxK_X6Qhhrt11"
}, {
  "tag": "P",
  "text": "As of today, there are 0 daily new cases of coronavirus in the entire 60 million-big region of Hubei.",
  "translation": "截至今天，湖北整个6000万大区域每天有0例冠状病毒新病例。"
}, {
  "tag": "P",
  "text": "The diagnostics would keep going up for a couple of weeks, but then they would start going down. With fewer cases, the fatality rate starts dropping too. And the collateral damage is also reduced: fewer people would die from non-coronavirus-related causes because the healthcare system is simply overwhelmed.",
  "translation": "诊断将持续上升几个星期，但随后它们将开始下降。 更少的情况下，病死率也开始下降。 而且附带损害也减少了：由于医疗体系简直不堪重负，死于与非冠状病毒无关的原因的人数将减少。"
}, {
  "tag": "P",
  "text": "Suppression would get us:",
  "translation": "抑制将使我们："
}, {
  "tag": "UL",
  "texts": ["Fewer total cases of Coronavirus", "Immediate relief for the healthcare system and the humans who run it", "Reduction in fatality rate", "Reduction in collateral damage", "Ability for infected, isolated and quarantined healthcare workers to get better and back to work. In Italy, healthcare workers represent 8% of all contagions."],
  "translations": ["冠状病毒病例总数减少", "立即减轻卫生保健系统及其运行人员的负担", "降低死亡率", "减少附带损害", "感染，隔离和隔离的医护人员有能力康复并恢复工作。 在意大利，医护人员占所有传染病的8％。"]
}, {
  "tag": "H2",
  "text": "Understand the True Problem: Testing and Tracing",
  "translation": "了解真正的问题：测试和跟踪"
}, {
  "tag": "P",
  "text": "Right now, the UK and the US have no idea about their true cases. We don’t know how many there are. We just know the official number is not right, and the true one is in the tens of thousands of cases. This has happened because we’re not testing, and we’re not tracing.",
  "translation": "目前，英国和美国对他们的真实情况一无所知。 我们不知道有多少。 我们只知道官方数字不正确，真正的数字是成千上万的案件。 发生这种情况是因为我们没有测试，也没有追踪。"
}, {
  "tag": "UL",
  "texts": ["With a few more weeks, we could get our testing situation in order, and start testing everybody. With that information, we would finally know the true extent of the problem, where we need to be more aggressive, and what communities are safe to be released from a lockdown.", "New testing methods could speed up testing and drive costs down substantially.", "We could also set up a tracing operation like the ones they have in China or other East Asia countries, where they can identify all the people that every sick person met, and can put them in quarantine. This would give us a ton of intelligence to release later on our social distancing measures: if we know where the virus is, we can target these places only. This is not rocket science: it’s the basics of how East Asia Countries have been able to control this outbreak without the kind of draconian social distancing that is increasingly essential in other countries."],
  "translations": ["再过几周，我们就可以整理测试情况，并开始对每个人进行测试。 有了这些信息，我们最终将知道问题的真正范围，需要在哪里采取更加积极的行动以及哪些社区可以安全地从锁定中释放出来。", "新的测试方法可以加快测试速度，并大幅降低成本。", "我们还可以像在中国或其他东亚国家/地区中一样，建立寻人机构，在那里他们可以识别每个病者遇到的所有人，并可以将他们隔离。 这将为我们提供大量的情报，以便稍后发布有关社会隔离措施的信息：如果我们知道病毒在哪里，我们就只能针对这些地方。 这不是火箭科学：这是东亚国家如何能够控制这次疫情而又没有其他国家日益严重的那种严峻的社会距离的基础。"]
}, {
  "tag": "P",
  "text": "The measures from this section (testing and tracing) single-handedly curbed the growth of the coronavirus in South Korea and got the epidemic under control, without a strong imposition of social distancing measures."
}, {
  "tag": "H2",
  "text": "Build Up Capacity",
  "translation": "建设能力"
}, {
  "tag": "P",
  "text": "The US (and presumably the UK) are about to go to war without armor.",
  "translation": "美国（大概是英国）将在没有装甲的情况下进行战争。"
}, {
  "tag": "P",
  "text": "We have masks for just two weeks, few personal protective equipments (“PPE”), not enough ventilators, not enough ICU beds, not enough ECMOs (blood oxygenation machines)… This is why the fatality rate would be so high in a mitigation strategy.",
  "translation": "我们只有两个星期的口罩，个人防护设备很少，通风机不足，ICU床位数不足，ECMO（血液氧合机）不足……这就是为什么在缓解策略中死亡率如此之高的原因 。"
}, {
  "tag": "P",
  "text": "But if we buy ourselves some time, we can turn this around:",
  "translation": "但是，如果我们花一些时间自己买，我们可以解决这个问题："
}, {
  "tag": "UL",
  "texts": ["We have more time to buy all the equipment we will need for a future wave", "We can quickly build up our production of masks, PPEs, ventilators, ECMOs, and any other critical device to reduce fatality rate."],
  "translations": ["我们有更多时间购买未来浪潮所需的所有设备", "我们可以快速建立口罩，个人防护设备，呼吸机，ECMO和其他任何重要设备的生产，以降低死亡率。"]
}, {
  "tag": "P",
  "text": "Put in another way: we don’t need years to get our armor, we need weeks. Let’s do everything we can to get our production humming now. Countries are mobilized. People are being inventive, such as using 3D printing for ventilator parts. We can do it. We just need more time. Would you wait a few weeks to get yourself some armor before facing a mortal enemy?",
  "translation": "换句话说：我们不需要几年的时间来获得装甲，我们需要数周。 让我们尽一切可能使我们的生产变得嗡嗡作响。 国家动员起来。 人们正在发挥创造力，例如将3D打印用于呼吸机零件。 我们可以做到这一点。 我们只需要更多时间。 在面对致命的敌人之前，您是否需要等待几周才能获得一些盔甲？"
}, {
  "tag": "P",
  "text": "This is not the only capacity we need. We will need health workers as soon as possible. Where will we get them? We need to train people to assist nurses, and we need to get medical workers out of retirement. Many countries have already started, but this takes time. We can do this in a few weeks, but not if everything collapses.",
  "translation": "这不是我们需要的唯一能力。 我们将尽快需要卫生工作者。 我们从哪里得到它们？ 我们需要培训人员以协助护士，还需要让医务人员退休。 许多国家已经开始，但这需要时间。 我们可以在几周内做到这一点，但是如果一切都崩溃了，那是不可能的。"
}, {
  "tag": "H2",
  "text": "Lower Public Contagiousness",
  "translation": "降低公众传染性"
}, {
  "tag": "P",
  "text": "The public is scared. The coronavirus is new. There’s so much we don’t know how to do yet! People haven’t learned to stop hand-shaking. They still hug. They don’t open doors with their elbow. They don’t wash their hands after touching a door knob. They don’t disinfect tables before sitting.",
  "translation": "公众感到害怕。 冠状病毒是新的。 我们还不知道怎么办！ 人们还没有学会停止握手。 他们仍然拥抱。 他们没有用肘打开门。 他们在触摸门把手后不会洗手。 他们在坐前不对桌子消毒。"
}, {
  "tag": "P",
  "text": "Once we have enough masks, we can use them outside of the healthcare system too. Right now, it’s better to keep masks for healthcare workers. But if they weren’t scarce, people should wear them in their daily lives, making it less likely that they infect other people when sick, and with proper training also reducing the likelihood that the wearers get infected. (In the meantime, wearing something is better than nothing.)",
  "translation": "一旦有了足够的口罩，我们也可以在医疗保健系统之外使用它们。 目前，最好为医护人员保留口罩。 但是，如果不稀缺，人们应该在日常生活中佩戴它们，这样一来，他们生病时感染他人的可能性就会降低，并且经过适当的培训还可以减少佩戴者被感染的可能性。 （与此同时，穿什么总比没有好。）"
}, {
  "tag": "P",
  "text": "All of these are pretty cheap ways to reduce the transmission rate. The less this virus propagates, the fewer measures we’ll need in the future to contain it. But we need time to educate people on all these measures and equip them.",
  "translation": "所有这些都是降低传输速率的非常便宜的方法。 该病毒传播的次数越少，我们将来需要采取的措施就越少。 但是我们需要时间对人们进行所有这些措施的教育并为其配备设备。"
}, {
  "tag": "H2",
  "text": "Understand the Virus",
  "translation": "了解病毒"
}, {
  "tag": "P",
  "text": "We know very very little about the virus. But every week, hundreds of new papers are coming.",
  "translation": "我们对该病毒知之甚少。 但是每周都有数百篇新论文到来。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/0*iQ46Nmq0qjAWRXBx?q=20",
  "type": "image",
  "file": "0!iQ46Nmq0qjAWRXBx"
}, {
  "tag": "P",
  "text": "The world is finally united against a common enemy. Researchers around the globe are mobilizing to understand this virus better.",
  "translation": "世界终于团结起来对抗一个共同的敌人。 全球研究人员正在动员以更好地了解这种病毒。"
}, {
  "tag": "P",
  "text": "How does the virus spread?How can contagion be slowed down?What is the share of asymptomatic carriers?Are they contagious? How much?What are good treatments?How long does it survive?On what surfaces?How do different social distancing measures impact the transmission rate?What’s their cost?What are tracing best practices?How reliable are our tests?",
  "translation": "病毒如何传播？如何减慢传染速度？无症状携带者所占份额是多少？它们具有传染性吗？ 多少钱？什么是好的治疗方法？它能存活多长时间？在什么表面上？不同的社会隔离措施如何影响传播率？它们的成本是多少？追踪最佳实践的方法是什么？测试的可靠性如何？"
}, {
  "tag": "P",
  "text": "Clear answers to these questions will help make our response as targeted as possible while minimizing collateral economic and social damage. And they will come in weeks, not years.",
  "translation": "对这些问题的明确答案将有助于使我们的响应尽可能有针对性，同时最大程度地减少附带的经济和社会损失。 他们将在几周内，而不是几年内到来。"
}, {
  "tag": "H2",
  "text": "Find Treatments",
  "translation": "寻找治疗"
}, {
  "tag": "P",
  "text": "Not only that, but what if we found a treatment in the next few weeks? Any day we buy gets us closer to that. Right now, there are already several candidates, such as Favipiravir or Chloroquine. What if it turned out that in two months we discovered a treatment for the coronavirus? How stupid would we look if we already had millions of deaths following a mitigation strategy?",
  "translation": "不仅如此，如果我们在接下来的几周内找到治疗方法，该怎么办？ 我们购买的任何一天都使我们更接近这一点。 目前，已经有几种候选药物，例如Favipiravir或Chloroquine。 如果事实证明，在两个月内我们发现了一种冠状病毒的治疗方法呢？ 如果我们在采取缓解策略后已经有数百万的死亡，我们会显得多么愚蠢？"
}, {
  "tag": "H2",
  "text": "Understand the Cost-Benefits",
  "translation": "了解成本效益"
}, {
  "tag": "P",
  "text": "All of the factors above can help us save millions of lives. That should be enough. Unfortunately, politicians can’t only think about the lives of the infected. They must think about all the population, and heavy social distancing measures have an impact on others.",
  "translation": "以上所有因素均可帮助我们挽救数百万生命。 那应该足够了。 不幸的是，政客们不仅会考虑被感染者的生活。 他们必须考虑所有人口，繁重的社会疏远措施会影响其他人。"
}, {
  "tag": "P",
  "text": "Right now we have no idea how different social distancing measures reduce transmission. We also have no clue what their economic and social costs are.",
  "translation": "目前，我们不知道不同的社会隔离措施如何减少传播。 我们也不知道他们的经济和社会成本是多少。"
}, {
  "tag": "P",
  "text": "Isn’t it a bit difficult to decide what measures we need for the long term if we don’t know their cost or benefit?",
  "translation": "如果我们不知道它们的成本或收益，那么决定我们长期需要的措施是否有点困难？"
}, {
  "tag": "P",
  "text": "A few weeks would give us enough time to start studying them, understand them, prioritize them, and decide which ones to follow.",
  "translation": "几周后，我们将有足够的时间开始学习它们，理解它们，确定它们的优先级并决定要遵循哪些。"
}, {
  "tag": "P",
  "text": "Fewer cases, more understanding of the problem, building up assets, understanding the virus, understanding the cost-benefit of different measures, educating the public… These are some core tools to fight the virus, and we just need a few weeks to develop many of them. Wouldn’t it be dumb to commit to a strategy that throws us instead, unprepared, into the jaws of our enemy?",
  "translation": "更少的案例，更多的了解问题，积累资产，了解病毒，了解各种措施的成本效益，教育公众……这些是抵抗病毒的一些核心工具，我们只需要几个星期的时间就可以开发出许多 其中。 承诺采取一种战略，使我们毫无准备地陷入敌人的下巴，这不是很愚蠢吗？"
}, {
  "tag": "H1",
  "text": "4. The Hammer and the Dance",
  "translation": "4.锤子与舞蹈"
}, {
  "tag": "P",
  "text": "Now we know that the Mitigation Strategy is probably a terrible choice, and that the Suppression Strategy has a massive short-term advantage.",
  "translation": "现在我们知道，缓解策略可能是一个糟糕的选择，并且抑制策略具有巨大的短期优势。"
}, {
  "tag": "P",
  "text": "But people have rightful concerns about this strategy:",
  "translation": "但是人们对此策略有合理的担忧："
}, {
  "tag": "UL",
  "texts": ["How long will it actually last?", "How expensive will it be?", "Will there be a second peak as big as if we didn’t do anything?"],
  "translations": ["实际上会持续多久？", "它要多少钱？", "如果我们什么都没做，还会有第二个高峰吗？"]
}, {
  "tag": "P",
  "text": "Here, we’re going to look at what a true Suppression Strategy would look like. We can call it the Hammer and the Dance.",
  "translation": "在这里，我们将研究一个真正的抑制策略。 我们可以将其称为“锤子与舞蹈”。"
}, {
  "tag": "H2",
  "text": "The Hammer",
  "translation": "锤子"
}, {
  "tag": "P",
  "text": "First, you act quickly and aggressively. For all the reasons we mentioned above, given the value of time, we want to quench this thing as soon as possible.",
  "translation": "首先，您要迅速而积极地采取行动。 由于上面提到的所有原因，给定时间的价值，我们希望尽快中止此事情。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/0*bEoaCdVtSGe4LCSa?q=20",
  "type": "image",
  "file": "0!bEoaCdVtSGe4LCSa"
}, {
  "tag": "P",
  "text": "One of the most important questions is: How long will this last?",
  "translation": "最重要的问题之一是：持续多长时间？"
}, {
  "tag": "P",
  "text": "The fear that everybody has is that we will be locked inside our homes for months at a time, with the ensuing economic disaster and mental breakdowns. This idea was unfortunately entertained in the famous Imperial College paper:",
  "translation": "每个人都担心，随着随之而来的经济灾难和精神崩溃，我们将一次被关在家里几个月。 不幸的是，这个想法在著名的帝国学院论文中得到了招待："
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/0*_sFIl_drawnoBYix?q=20",
  "type": "image",
  "file": "0!_sFIl_drawnoBYix"
}, {
  "tag": "P",
  "text": "Do you remember this chart? The light blue area that goes from end of March to end of August is the period that the paper recommends as the Hammer, the initial suppression that includes heavy social distancing.",
  "translation": "你还记得这张图吗？ 从3月底到8月底的淡蓝色区域是本文推荐的“锤子”时期，其中包括严重的社会距离。"
}, {
  "tag": "P",
  "text": "If you’re a politician and you see that one option is to kill hundreds of thousands or millions of people with a mitigation strategy and the other is to stop the economy for five months before going through the same peak of cases and deaths again, these don’t sound like compelling options."
}, {
  "tag": "P",
  "text": "But this doesn’t need to be so. This paper, driving policy today, has been brutally criticized for core flaws: They ignore contact tracing (at the core of policies in South Korea, China or Singapore among others) or travel restrictions (critical in China), ignore the impact of big crowds…",
  "translation": "但这不是必须的。 这份针对当今驾驶政策的论文因存在核心缺陷而遭到残酷的批评：他们忽略了联系追踪（在韩国，中国或新加坡等政策的核心）或旅行限制（在中国至关重要），忽略了大批人群的影响 …"
}, {
  "tag": "P",
  "text": "The time needed for the Hammer is weeks, not months.",
  "translation": "锤子需要的时间是几周，而不是几个月。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/0*9B2kAok2lkL0EaQv?q=20",
  "type": "image",
  "file": "0!9B2kAok2lkL0EaQv"
}, {
  "tag": "P",
  "text": "This graph shows the new cases in the entire Hubei region (60 million people) every day since 1/23. Within 2 weeks, the country was starting to get back to work. Within ~5 weeks it was completely under control. And within 7 weeks the new diagnostics was just a trickle. Let’s remember this was the worst region in China.",
  "translation": "该图显示了自1/23以来每天湖北地区的新病例（6000万人）。 在2周内，该国开始恢复工作。 在约5周内，它已完全受到控制。 在7周内，新的诊断方法只是a花一现。 让我们记住这是中国最糟糕的地区。"
}, {
  "tag": "P",
  "text": "Remember again that these are the orange bars. The grey bars, the true cases, had plummeted much earlier.",
  "translation": "再次记住，这些是橙色条。 真实情况下的灰色条早就暴跌了。"
}, {
  "tag": "P",
  "text": "The measures they took were pretty similar to the ones taken in Italy, Spain or France: isolations, quarantines, people had to stay at home unless there was an emergency or had to buy food, contact tracing, testing, more hospital beds, travel bans… They were, however, more strict: for example, people were limited to one person per household allowed to leave home every three days to buy food. Also, their enforcement was severe. It is likely that this severity stopped the epidemic faster, but the current lockdowns in Europe are likely to have a similar result, even if not as fast."
}, {
  "tag": "P",
  "text": "Can we stay home for a few weeks to make sure millions don’t die? I think we can. It depends on what comes next, though.",
  "translation": "我们可以在家里呆几周以确保数百万人不会死亡吗？ 我想我们可以。 不过，这取决于接下来发生的事情。"
}, {
  "tag": "H2",
  "text": "The Dance",
  "translation": "舞蹈"
}, {
  "tag": "P",
  "text": "If you hammer the coronavirus, within a few weeks you’ve controlled it and you’re in much better shape to address it. Now comes the longer-term effort to keep this virus contained until there’s a vaccine.",
  "translation": "如果您对冠状病毒进行锤击，那么在几周之内您就可以控制它，并且您将可以更好地应对它。 现在需要长期的努力来控制这种病毒，直到有疫苗为止。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*a9Lcz2g8DkKdnW0o_vk3ow.png?q=20",
  "type": "image",
  "file": "1!a9Lcz2g8DkKdnW0o_vk3ow.png"
}, {
  "tag": "P",
  "text": "This is probably the single biggest, most important mistake people make when thinking about this stage: they think it will keep them home for months. This is not the case at all. In fact, it is likely that our lives will go back to close to normal.",
  "translation": "这可能是人们在考虑此阶段时犯下的最大，最重要的错误：他们认为它将使他们待在家里几个月。 事实并非如此。 实际上，我们的生活可能会恢复正常。"
}, {
  "tag": "H2",
  "text": "The Dance in Successful Countries",
  "translation": "成功国家的舞蹈"
}, {
  "tag": "P",
  "text": "How come South Korea, Singapore, Taiwan and Japan have had cases for a long time, in the case of South Korea thousands of them, and yet they’re not locked down home?",
  "translation": "在韩国，新加坡，台湾和日本，有很长的案件是怎么发生的？在韩国，成千上万的案件却没有被关在家里？"
}, {
  "tag": "H2",
  "text": "Coronavirus: South Korea seeing a 'stabilising trend'",
  "translation": "冠状病毒：韩国看到了“稳定趋势”"
}, {
  "tag": "H3",
  "text": "South Korea's Foreign Minister, Kang Kyung-wha, says she thinks early testing has been the key to South Korea's low…",
  "translation": "韩国外交大臣姜京华说，她认为早期测试一直是韩国经济低迷的关键。"
}, {
  "tag": "P",
  "text": "In this video, the South Korea Foreign Minister explains how her country did it. It was pretty simple: efficient testing, efficient tracing, travel bans, efficient isolating and efficient quarantining.",
  "translation": "在此视频中，韩国外相解释了韩国的做法。 这非常简单：有效的测试，有效的跟踪，旅行禁令，有效的隔离和有效的隔离。"
}, {
  "tag": "P",
  "text": "This paper explains Singapore’s approach:",
  "translation": "本文介绍了新加坡的做法："
}, {
  "tag": "H2",
  "text": "Interrupting transmission of COVID-19: lessons from containment efforts in Singapore",
  "translation": "中断COVID-19的传播：新加坡遏制工作的经验教训"
}, {
  "tag": "H3",
  "text": "Highlight. Despite multiple importations resulting in local chains of transmission, Singapore has been able to control…",
  "translation": "突出。 尽管多次进口导致当地的传播链，新加坡仍然能够控制…"
}, {
  "tag": "P",
  "text": "Want to guess their measures? The same ones as in South Korea. In their case, they complemented with economic help to those in quarantine and travel bans and delays.",
  "translation": "想猜测他们的措施吗？ 与韩国相同。 在他们的情况下，他们为隔离和旅行禁令和延误提供了经济帮助。"
}, {
  "tag": "P",
  "text": "Is it too late for other countries? No. By applying the Hammer, you’re getting a new chance, a new shot at doing this right.",
  "translation": "对于其他国家来说为时已晚？ 不会。通过应用锤子，您将获得新的机会，并且可以正确地做到这一点。"
}, {
  "tag": "P",
  "text": "But what if all these measures aren’t enough?",
  "translation": "但是，如果所有这些措施还不够呢？"
}, {
  "tag": "H2",
  "text": "The Dance of R",
  "translation": "R之舞"
}, {
  "tag": "P",
  "text": "I call the months-long period between the Hammer and a vaccine the Dance because it won’t be a period during which measures are always the same harsh ones. Some regions will see outbreaks again, others won’t for long periods of time. Depending on how cases evolve, we will need to tighten up social distancing measures or we will be able to release them. That is the dance of R: a dance of measures between getting our lives back on track and spreading the disease, one of economy vs. healthcare.",
  "translation": "我将锤子和疫苗之间的长达数月的时间称为舞蹈，因为这期间的措施永远不会相同。 有些地区会再次爆发，而其他地区则不会很长一段时间。 根据情况的演变，我们将需要加强社会疏离措施，或者我们将能够释放这些措施。 这就是R的舞步：经济与医疗保健之间的一种舞步，它使我们的生活重回正轨并传播疾病。"
}, {
  "tag": "P",
  "text": "How does this dance work?",
  "translation": "这种舞蹈如何运作？"
}, {
  "tag": "P",
  "text": "It all turns around the R. If you remember, it’s the transmission rate. Early on in a standard, unprepared country, it’s somewhere between 2 and 3: During the few weeks that somebody is infected, they infect between 2 and 3 other people on average.",
  "translation": "所有这些都绕着R旋转。如果您还记得的话，那就是传输速率。 在一个标准的，没有准备的国家中，早期感染率大约在2到3之间：在有人感染的几周内，他们平均感染另外2到3个其他人。"
}, {
  "tag": "P",
  "text": "If R is above 1, infections grow exponentially into an epidemic. If it’s below 1, they die down."
}, {
  "tag": "P",
  "text": "During the Hammer, the goal is to get R as close to zero, as fast as possible, to quench the epidemic. In Wuhan, it is calculated that R was initially 3.9, and after the lockdown and centralized quarantine, it went down to 0.32.",
  "translation": "在“锤子”行动期间，目标是使R尽可能快地接近零，以消除流行病。 在武汉，计算得出的R最初为3.9，在锁定和集中隔离后，R下降到0.32。"
}, {
  "tag": "P",
  "text": "But once you move into the Dance, you don’t need to do that anymore. You just need your R to stay below 1. And you can do a lot of that just with a few simple measures",
  "translation": "但是一旦您跳入舞蹈中，就无需再这样做了。 您只需要将R保持在1以下即可。只需执行一些简单的措施就可以完成很多操作"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*WGCbwDAHS1KwXGKoEydLUA.png?q=20",
  "caption": "Detailed data, sources and assumptions here",
  "type": "image",
  "file": "1!WGCbwDAHS1KwXGKoEydLUA.png"
}, {
  "tag": "P",
  "text": "This is an approximation of how different types of patients respond to the virus, as well as their contagiousness. Nobody knows the true shape of this curve, but we’ve gathered data from different papers to approximate how it looks like.",
  "translation": "这是不同类型的患者对病毒的反应方式以及其传染性的近似值。 没人知道这条曲线的真实形状，但是我们已经从不同的论文中收集了数据，以近似其外观。"
}, {
  "tag": "P",
  "text": "Every day after they contract the virus, people have some contagion potential. Together, all these days of contagion add up to 2.5 contagions on average.",
  "translation": "感染病毒后，人们每天都有一定的传播潜力。 所有这些传染病天加起来平均平均有2.5传染病。"
}, {
  "tag": "P",
  "text": "It is believed that there are some contagions already happening during the “no symptoms” phase. After that, as symptoms grow, usually people go do the doctor, get diagnosed, and their contagiousness diminishes."
}, {
  "tag": "P",
  "text": "For example, early on you have the virus but no symptoms, so you behave as normal. When you speak with people, you spread the virus. When you touch your nose and then open door knob, the next people to open the door and touch their nose get infected.",
  "translation": "例如，您早期感染了病毒但没有症状，因此您的行为正常。 与人交谈时，会传播病毒。 当您触摸鼻子然后打开门把手时，下一个打开门并触摸鼻子的人会被感染。"
}, {
  "tag": "P",
  "text": "The more the virus is growing inside you, the more infectious you are. Then, once you start having symptoms, you might slowly stop going to work, stay in bed, wear a mask, or start going to the doctor. The bigger the symptoms, the more you distance yourself socially, reducing the spread of the virus.",
  "translation": "病毒在您体内繁殖的越多，您的感染力就越大。 然后，一旦出现症状，您可能会慢慢停止上班，卧床休息，戴口罩或开始就医。 症状越大，您与社交的距离就越远，从而减少了病毒的传播。"
}, {
  "tag": "P",
  "text": "Once you’re hospitalized, even if you are very contagious you don’t tend to spread the virus as much since you’re isolated.",
  "translation": "一旦住院，即使您具有极强的传染性，您也不会因为自己被隔离而传播那么多病毒。"
}, {
  "tag": "P",
  "text": "This is where you can see the massive impact of policies like those of Singapore or South Korea:",
  "translation": "在这里，您可以看到新加坡或韩国等政策的巨大影响："
}, {
  "tag": "UL",
  "texts": ["If people are massively tested, they can be identified even before they have symptoms. Quarantined, they can’t spread anything.", "If people are trained to identify their symptoms earlier, they reduce the number of days in blue, and hence their overall contagiousness", "If people are isolated as soon as they have symptoms, the contagions from the orange phase disappear.", "If people are educated about personal distance, mask-wearing, washing hands or disinfecting spaces, they spread less virus throughout the entire period."],
  "translations": ["如果人们经过大量测试，则甚至可以在症状出现之前就将其识别出来。 被隔离，他们什么也不能传播。", "如果人们受过训练以及早发现症状，则他们可以减少蓝色的工作天数，从而降低总体传染性", "如果人们一出现症状就被隔离，橙色相的传染就会消失。", "如果人们受过有关个人距离，戴口罩，洗手或消毒空间的教育，那么在整个时期内，他们传播的病毒较少。"]
}, {
  "tag": "P",
  "text": "Only when all these fail do we need heavier social distancing measures.",
  "translation": "只有当所有这些都失败时，我们才需要采取更大的社会隔离措施。"
}, {
  "tag": "H2",
  "text": "The ROI of Social Distancing",
  "translation": "社会距离的投资回报率"
}, {
  "tag": "P",
  "text": "If with all these measures we’re still way above R=1, we need to reduce the average number of people that each person meets."
}, {
  "tag": "P",
  "text": "There are some very cheap ways to do that, like banning events with more than a certain number of people (eg, 50, 500), or asking people to work from home when they can.",
  "translation": "有一些非常便宜的方法可以做到这一点，例如禁止超过一定人数（例如50、500）的人参加活动，或者要求人们在可能的情况下在家工作。"
}, {
  "tag": "P",
  "text": "Other are much, much more expensive, such as closing schools and universities, asking everybody to stay home, or closing bars and restaurants.",
  "translation": "其他的则要贵得多，例如关闭学校和大学，要求所有人呆在家里或关闭酒吧和餐馆。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*sBtw2JcHn6dmJmUp22cExA.png?q=20",
  "type": "image",
  "file": "1!sBtw2JcHn6dmJmUp22cExA.png"
}, {
  "tag": "P",
  "text": "This chart is made up because it doesn’t exist today. Nobody has done enough research about this or put together all these measures in a way that can compare them.",
  "translation": "该图表已编入，因为今天不存在。 没有人对此进行足够的研究或以可以比较它们的方式将所有这些措施组合在一起。"
}, {
  "tag": "P",
  "text": "It’s unfortunate, because it’s the single most important chart that politicians would need to make decisions. It illustrates what is really going through their minds.",
  "translation": "不幸的是，因为这是政客做出决定所需的最重要的单个图表。 它说明了他们思想中真正发生的事情。"
}, {
  "tag": "P",
  "text": "During the Hammer period, they want to go as low as possible while still remaining tolerable. In Hubei, they went all the way to 0.32. We might not need that: maybe just to 0.5 or 0.6.",
  "translation": "在“锤子”时期，他们希望尽可能降低，同时仍能承受。 在湖北，他们一路攀升至0.32。 我们可能不需要：可能只是0.5或0.6。"
}, {
  "tag": "P",
  "text": "But during the Dance of the R period, they want to hover as close to 1 as possible, while staying below it over the long term term.",
  "translation": "但是在R的“ Dance”期间，他们希望将鼠标悬停在尽可能接近1的位置，同时长期保持在该水平以下。"
}, {
  "tag": "P",
  "text": "What this means is that, whether leaders realize it or not, what they’re doing is:",
  "translation": "这意味着无论领导者是否意识到这一点，他们在做什么："
}, {
  "tag": "UL",
  "texts": ["List all the measures they can take to reduce R", "Get a sense of the benefit of applying them: the reduction in R", "Get a sense of their cost: the economic and social cost.", "Stack-rank the initiatives based on their cost-benefit", "Pick the ones that give the biggest R reduction up till 1, for the lowest cost."],
  "translations": ["列出他们可以采取的减少R的所有措施", "了解应用它们的好处：R的减少", "了解其成本：经济和社会成本。", "根据成本效益对计划进行排名", "选择那些将R减少最大到1的那些，以最低的成本。"]
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*dP9WeeP3e-qbGkyG-Jm2fA.png?q=20",
  "caption": "This is for illustrative purposes only. All data is made up. However, as far as we were able to tell, this data doesn’t exist today. It needs to.",
  "type": "image",
  "file": "1!dP9WeeP3e-qbGkyG-Jm2fA.png"
}, {
  "tag": "P",
  "text": "Initially, their confidence on these numbers will be low. But that‘s still how they are thinking—and should be thinking about it.",
  "translation": "最初，他们对这些数字的信心将很低。 但这仍然是他们的思考方式-应该考虑这一点。"
}, {
  "tag": "P",
  "text": "What they need to do is formalize the process: Understand that this is a numbers game in which we need to learn as fast as possible where we are on R, the impact of every measure on reducing R, and their social and economic costs.",
  "translation": "他们需要做的是使过程正式化：了解这是一个数字游戏，我们需要尽快学习我们在R上的位置，每项措施对降低R的影响以及它们的社会和经济成本。"
}, {
  "tag": "P",
  "text": "Only then will they be able to make a rational decision on what measures they should take.",
  "translation": "只有这样，他们才能对应该采取的措施做出理性的决定。"
}, {
  "tag": "H1",
  "text": "Conclusion: Buy Us Time",
  "translation": "结论：给我们买时间"
}, {
  "tag": "P",
  "text": "The coronavirus is still spreading nearly everywhere. 152 countries have cases. We are against the clock. But we don’t need to be: there’s a clear way we can be thinking about this.",
  "translation": "冠状病毒仍在几乎各处传播。 152个国家有病例。 我们不分昼夜。 但是我们不必如此：有一种清晰的方法可以考虑这一点。"
}, {
  "tag": "P",
  "text": "Some countries, especially those that haven’t been hit heavily yet by the coronavirus, might be wondering: Is this going to happen to me? The answer is: It probably already has. You just haven’t noticed. When it really hits, your healthcare system will be in even worse shape than in wealthy countries where the healthcare systems are strong. Better safe than sorry, you should consider taking action now.",
  "translation": "有些国家，尤其是那些尚未受到冠状病毒严重打击的国家，可能会想知道：这会发生在我身上吗？ 答案是：可能已经有了。 您只是没有注意到。 真正奏效时，您的医疗系统将比那些拥有强大医疗系统的富裕国家更加糟糕。 安全好过后悔，现在应该考虑采取行动。"
}, {
  "tag": "P",
  "text": "For the countries where the coronavirus is already here, the options are clear.",
  "translation": "对于已经存在冠状病毒的国家，选项很明确。"
}, {
  "tag": "P",
  "text": "On one side, countries can go the mitigation route: create a massive epidemic, overwhelm the healthcare system, drive the death of millions of people, and release new mutations of this virus in the wild.",
  "translation": "一方面，各国可以采取缓解措施：制造大规模的流行病，淹没医疗系统，驱使数百万人死亡，并在野外释放这种病毒的新突变。"
}, {
  "tag": "P",
  "text": "On the other, countries can fight. They can lock down for a few weeks to buy us time, create an educated action plan, and control this virus until we have a vaccine.",
  "translation": "另一方面，国家可以战斗。 他们可以锁定几个星期来为我们争取时间，制定受过教育的行动计划，并控制这种病毒，直到我们获得疫苗为止。"
}, {
  "tag": "P",
  "text": "Governments around the world today, including some such as the US, the UK, Switzerland or Netherlands have so far chosen the mitigation path.",
  "translation": "迄今为止，包括美国，英国，瑞士或荷兰在内的世界各国政府已经选择了缓解途径。"
}, {
  "tag": "P",
  "text": "That means they’re giving up without a fight. They see other countries having successfully fought this, but they say: “We can’t do that!”",
  "translation": "这意味着他们不战而放弃。 他们看到其他国家已经成功地与之抗争，但他们说：“我们不能这样做！”"
}, {
  "tag": "P",
  "text": "What if Churchill had said the same thing? “Nazis are already everywhere in Europe. We can’t fight them. Let’s just give up.” This is what many governments around the world are doing today. They’re not giving you a chance to fight this. You have to demand it.",
  "translation": "如果丘吉尔说了同样的话怎么办？ 纳粹分子已经在欧洲无处不在。 我们不能打架。 让我们放弃吧。” 这就是当今世界许多政府正在做的事情。 他们没有给您机会与之抗争。 您必须要求它。"
}, {
  "tag": "H1",
  "text": "Share the Word",
  "translation": "分享词"
}, {
  "tag": "P",
  "text": "Unfortunately, millions of lives are still at stake. Share this article—or any similar one—if you think it can change people’s opinion. Leaders need to understand this to avert a catastrophe. The moment to act is now.",
  "translation": "不幸的是，数百万人的生命仍然处于危险之中。 如果您认为这篇文章可以改变人们的看法，请分享此文章（或任何类似的文章）。 领导者需要了解这一点，以免发生灾难。 现在该采取行动了。"
}, {
  "tag": "P",
  "text": "Anyone can publish on Medium per our Policies, but we don’t fact-check every story. For more info about the coronavirus, see cdc.gov.",
  "translation": "任何人都可以按照我们的政策在“中”上发布，但我们并没有对每个故事进行事实检查。 有关冠状病毒的更多信息，请参见cdc.gov。"
}, {
  "tag": "PRE",
  "text": "(本文翻译自Tomas Pueyo的文章《Coronavirus: The Hammer and the Dance》，参考：https://medium.com/@tomaspueyo/coronavirus-the-hammer-and-the-dance-be9337092b56)"
}]