[{
  "tag": "H1",
  "text": "10. Coding Your Own Project",
  "translation": "10.编写自己的项目"
}, {
  "tag": "P",
  "text": "Last, but definitely not least you could create your own project that generates revenue. This has the great advantage that you could work on something that you really like — which is always a good idea. The downside is that you could be developing an application that nobody blinks an eye at.",
  "translation": "最后，但同样重要的是，您可以创建自己的产生收入的项目。 这具有很大的优势，您可以从事自己真正喜欢的工作-这总是一个好主意。 不利之处是您可能正在开发一个没人眨眼的应用程序。"
}, {
  "tag": "P",
  "text": "However, the goal of this is to build an app or website that provides some sort of product or service for people. This could generate revenue over time either by selling the product or service or by doing stuff.",
  "translation": "但是，这样做的目的是构建可为人们提供某种产品或服务的应用程序或网站。 通过销售产品或服务或做某事，这可以随时间产生收入。"
}, {
  "tag": "H1",
  "text": "9. Webshop",
  "translation": "9.网上商店"
}, {
  "tag": "P",
  "text": "Online shopping has had exponential growth over the last decade. The amount of people that buy stuff online only tends to increase. You could take advantage of this by running a webshop yourself.",
  "translation": "在线购物在过去十年中呈指数增长。 在线购买商品的人数只会增加。 您可以自己运行网上商店来利用此优势。"
}, {
  "tag": "P",
  "text": "If you have physical goods that you want to sell, you could choose to make your own webshop. You could use a platform like Shopify for this, but wouldn’t it be much more fun to create a webshop from scratch?",
  "translation": "如果您有要出售的实物商品，则可以选择创建自己的网上商店。 您可以为此使用类似Shopify的平台，但是从头开始创建网店会不会很有趣？"
}, {
  "tag": "P",
  "text": "Another way to make money with a webshop is by drop-shipping. Drop-shipping has the great advantage that you don’t need any items on stock. Once someone buys a product from your webshop, you send that order directly to the manufacturer. The manufacturer ships the product directly to your customer. Drop-shipping allows you to start your own webshop without needing to invest a chunk of money on products upfront.",
  "translation": "通过网上商店赚钱的另一种方法是通过托运。 托运具有很大的优势，您不需要库存任何物品。 有人从您的网上商店购买产品后，您便将该订单直接发送给制造商。 制造商将产品直接运送给您的客户。 直接发货使您可以建立自己的网上商店，而无需在产品前期投入大笔资金。"
}, {
  "tag": "H1",
  "text": "8. Coaching",
  "translation": "8.指导"
}, {
  "tag": "P",
  "text": "Being able to teach people online is a great skill to have if you want to make some extra money. Online teaching comes with great benefits for both the student and the teacher.",
  "translation": "如果您想赚更多的钱，能够在线教人是一项很棒的技能。 在线教学对学生和老师都有很大的好处。"
}, {
  "tag": "P",
  "text": "Although this one is pretty straightforward it’s probably only for those who are a little bit more experienced. When you have a topic that you’re very passionate about and you have the skills under your belt, you could start to offer coaching sessions to more inexperienced developers.",
  "translation": "尽管这一过程非常简单，但可能仅适用于那些经验丰富的人。 当您对某个主题非常感兴趣并且掌握了技巧之后，就可以开始向经验不足的开发人员提供辅导课程。"
}, {
  "tag": "P",
  "text": "This way you can turn your knowledge in a winning combination by offering your services through one-on-one online coaching sessions. If you want to help more people in the same amount of time you could start group coaching.",
  "translation": "这样，您可以通过一对一的在线辅导课程提供服务，从而将知识转化为成功的组合。 如果您想在相同的时间内帮助更多的人，则可以开始团体教练。"
}, {
  "tag": "H1",
  "text": "7. Podcast",
  "translation": "7.播客"
}, {
  "tag": "P",
  "text": "The best alternative for those who don’t like to be in front of a camera but still would love to share their knowledge with others. If you’re an expert in your field, but a little bit camera shy, podcasts are the way to go to spread your message.",
  "translation": "对于那些不想坐在镜头前但仍然愿意与他人分享知识的人来说，这是最好的选择。 如果您是该领域的专家，但对照相机有点害羞，则可以使用播客来传播您的信息。"
}, {
  "tag": "P",
  "text": "And the best thing about podcasts is that they’re becoming more and more popular. Tons of people listen to podcasts while they’re working or before they go to bed.",
  "translation": "关于播客，最棒的是，它们越来越受欢迎。 很多人在工作中或上床睡觉前收听播客。"
}, {
  "tag": "P",
  "text": "However, it’s good to know that most podcasts are completely free to listen to, so making money from podcasts is going to be more of a side-effect. See it as an extra opportunity to build your personal brand.",
  "translation": "但是，很高兴知道大多数播客都是完全可以免费收听的，因此从播客中赚钱会带来更多的副作用。 将其视为建立个人品牌的额外机会。"
}, {
  "tag": "P",
  "text": "There are some platforms where you could get paid for your podcast, like Patreon. This is a platform where people can support your work and unlock exclusive content by paying you a monthly amount.",
  "translation": "在某些平台上，您可以从中获得付款，例如Patreon。 这是一个平台，人们可以通过每月向您付款来支持您的工作并解锁专有内容。"
}, {
  "tag": "H1",
  "text": "6. Create a Wordpress Plugin",
  "translation": "6.创建一个Wordpress插件"
}, {
  "tag": "P",
  "text": "A lot of webpages are powered by Wordpress — around 35 percent of all webpages. This means that there is a high demand for great Wordpress plugins that could improve a website.",
  "translation": "许多网页均由Wordpress提供支持-约占所有网页的35％。 这意味着对可以改善网站的出色Wordpress插件有很高的要求。"
}, {
  "tag": "P",
  "text": "If you’re a developer with some spare time, building a Wordpress plugin can be a great way to make some money from home. And the best part about it is that it is pretty easy to get started.",
  "translation": "如果您是一位有空余时间的开发人员，那么构建Wordpress插件可能是一种在家赚钱的好方法。 最好的部分是它很容易上手。"
}, {
  "tag": "P",
  "text": "The best idea for a Wordpress plugin may emerge from the frustration and limitations of existing tools. However, you can make anything you would like to. From a donation plugin to a plugin that provides social share buttons.",
  "translation": "Wordpress插件的最佳想法可能来自现有工具的沮丧和局限。 但是，您可以做任何您想做的事情。 从捐赠插件到提供社交共享按钮的插件。"
}, {
  "tag": "P",
  "text": "You can choose to make it available for free, and earn the money through advertising or donations. But you could also go the route that most people take: a minimum free version with an option to pay for extra features. This is a very popular way to make some money with code!",
  "translation": "您可以选择免费提供它，并通过广告或捐赠来赚钱。 但是，您也可以走大多数人走的路：最低的免费版本，可以选择支付额外的功能。 这是一种非常流行的通过代码赚钱的方法！"
}, {
  "tag": "H1",
  "text": "5. Freelancing",
  "translation": "5.自由职业"
}, {
  "tag": "P",
  "text": "It’s easy to offer your programming skills and services online. There are various online freelancing platforms where you could look for a gig. Find one that works best for you.",
  "translation": "在线提供编程技能和服务很容易。 有各种各样的在线自由职业平台，您可以在这里找演出。 寻找最适合您的产品。"
}, {
  "tag": "P",
  "text": "Freelancing comes with a bunch of benefits. You’ll not only enjoy flexible work schedules but also the freedom of working when and where you want. On top of that, you can grow your experience as a developer in the freelancing platforms. Once you’ve built up some reputation you should be able to make a decent amount of money.",
  "translation": "自由职业带来许多好处。 您不仅可以享受弹性的工作时间表，还可以在需要的时间和地点自由地工作。 最重要的是，您可以在自由职业者平台上发展自己的开发经验。 建立声誉后，您应该可以赚到可观的钱。"
}, {
  "tag": "P",
  "text": "However, I want to make a side note here. Since there’s so much competition the rates are pretty low on these freelance platforms. I’d only recommend this if you’re just starting out and want to dip your toes into the water for the first time. Use these freelance platforms, not for the money, but just to gain additional experience and getting comfortable working with clients.",
  "translation": "但是，我想在这里做一个旁注。 由于竞争如此激烈，这些自由职业者平台上的费率很低。 仅当您刚开始并想将脚趾第一次浸入水中时，我才建议您这样做。 使用这些自由平台，不是为了钱，而是为了获得更多经验并与客户合作感到舒适。"
}, {
  "tag": "H1",
  "text": "4. Create a Theme",
  "translation": "4.创建一个主题"
}, {
  "tag": "P",
  "text": "There are a lot of people that have a website but don’t know anything about coding. Those people often use a solution like Wordpress. Since they don’t know how to code it’s hard, if not impossible, for them to change their website besides some standard configuration that they could tweak. These people rely heavily on the themes that are available on the marketplaces.",
  "translation": "很多人都有网站，但对编码一无所知。 这些人经常使用像Wordpress这样的解决方案。 由于他们不知道如何编写代码，因此，除了进行一些可以调整的标准配置外，他们很难（即使不是不可能）更改网站。 这些人严重依赖于市场上可用的主题。"
}, {
  "tag": "P",
  "text": "And this is where a great opportunity lies for you. You could create your own theme and sell it on a marketplace like Themeforest. Once you’ve built your theme you have the opportunity to sell it to millions of people all over the world.",
  "translation": "这就是您的绝佳机会。 您可以创建自己的主题，然后在诸如Themeforest之类的市场上出售。 建立主题之后，您就有机会将其出售给全世界数以百万计的人。"
}, {
  "tag": "P",
  "text": "You could also build a theme for Drupal or Joomla if you’d prefer that. However, note that these are less popular and used than Wordpress. So if you don’t have a preference for either of these frameworks I’d suggest that you go for Wordpress.",
  "translation": "如果您愿意，也可以为Drupal或Joomla构建主题。 但是，请注意，这些功能不如Wordpress流行和使用。 因此，如果您对这两个框架都不偏好，建议您选择Wordpress。"
}, {
  "tag": "H1",
  "text": "3. App Development",
  "translation": "3.应用开发"
}, {
  "tag": "P",
  "text": "Apps have the potential to make you a lot of money. But there is a huge if-statement that has to be made here. In order to make money with apps, you need to have a good idea. If the idea isn’t that great, chances are that there won’t be any money made.",
  "translation": "应用程序有可能为您带来很多收益。 但是，这里必须制定一个巨大的if陈述。 为了通过应用赚钱，您需要有一个好主意。 如果这个主意不是那么好，那么很可能不会有任何赚钱的机会。"
}, {
  "tag": "P",
  "text": "The best example of this is Flappy Bird. The app could have been made by a 13-year-old since it isn’t complex by any means. In fact, it could be a great starter project for you if you’re new to app game development. However, the idea of Flappy Bird turned out to be a fantastic one. It reported $50,000 dollars per day of advertising income at its prime time.",
  "translation": "最好的例子是飞扬的小鸟。 该应用程序可能是由13岁的人制作的，因为它并不复杂。 实际上，如果您不熟悉应用程序游戏开发，那么这对您来说可能是一个不错的入门项目。 但是，“飞扬的小鸟”的想法却是一个了不起的想法。 据报道，黄金时段每天的广告收入为50,000美元。"
}, {
  "tag": "P",
  "text": "Note that most apps only last for a short period of time so it probably isn’t going to generate much revenue in the long run.",
  "translation": "请注意，大多数应用只能持续很短的时间，因此从长远来看，它可能不会产生太多收入。"
}, {
  "tag": "H1",
  "text": "2. Blogging",
  "translation": "2.博客"
}, {
  "tag": "P",
  "text": "As a developer, you can always start a blog in the programming niche. There are many ways to monetize a blog as a programmer, which includes offering coding skills online and earning through affiliate links. However, you could also start posting at Medium.",
  "translation": "作为开发人员，您始终可以在编程领域中创建博客。 有多种方法可以通过博客将程序员货币化，包括在线提供编码技能和通过会员链接赚钱。 但是，您也可以在Medium开始发布。"
}, {
  "tag": "P",
  "text": "If you’re passionate about writing I would highly recommend you start your own blog. It’s a great way to share your knowledge with other people.",
  "translation": "如果您对写作充满热情，强烈建议您创建自己的博客。 与他人分享您的知识的好方法。"
}, {
  "tag": "P",
  "text": "You can start your own blog publishing some programming tutorials about what you are learning or just learned. Keep posting updates on a regular basis about the progress that you’re making.",
  "translation": "您可以开始自己的博客，发布一些关于您正在学习或刚刚学到的编程教程。 定期发布有关您的进度的更新。"
}, {
  "tag": "H1",
  "text": "1. Help a Local Business",
  "translation": "1.帮助当地企业"
}, {
  "tag": "P",
  "text": "One of the easiest options is to ask family and friends. Try to find a few people that have a small business and that are in need of a new website or some improvements on their existing website.",
  "translation": "最简单的选择之一就是问家人和朋友。 尝试找到一些生意不佳，需要新网站或需要对现有网站进行一些改进的人。"
}, {
  "tag": "P",
  "text": "If you’re just starting out as a developer and this is one of your first paid projects you could consider doing it for free. This way you can add the project to your resume to show other people what you’re capable of.",
  "translation": "如果您刚开始是一名开发人员，并且这是您的第一个付费项目，则可以考虑免费进行。 这样，您可以将项目添加到简历中，以向其他人展示您的能力。"
}, {
  "tag": "P",
  "text": "Once you’ve successfully completed the job you could ask your client if they know anyone else with a business who might be interested in your services. This way you can start building your network of clients.",
  "translation": "成功完成工作后，您可以询问您的客户，如果他们认识其他与您的服务感兴趣的人。 这样，您就可以开始建立客户网络。"
}, {
  "tag": "P",
  "text": "If you really want to be proactive you could start looking for shitty websites of businesses that are near you. Come up with a better design or create (a part of) the website upfront. Don’t just walk in and ask them if they need a new website, because the answer is going to be no most of the time. Provide value upfront!",
  "translation": "如果您真的想积极主动，可以开始寻找附近商家的肮脏网站。 提出更好的设计或预先创建网站（的一部分）。 不要只是问他们是否需要一个新网站，因为答案通常不会在大多数时间。 预先提供价值！"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/0*ujbM1dzSi1T544mV?q=20",
  "caption": "Photo by Jp Valery on Unsplash",
  "type": "image",
  "file": "0!ujbM1dzSi1T544mV"
}, {
  "tag": "H1",
  "text": "How To Make Money With Code",
  "translation": "如何用代码赚钱"
}, {
  "tag": "H2",
  "text": "10 things you could do to earn some money",
  "translation": "赚钱可以做的10件事"
}, {
  "tag": "P",
  "text": "Knowing how to code is a really valuable skill that could end up making you a lot of money. There are tons of ways when it comes to making money with code. The only thing that limits all the opportunities for you earning money with code is your own creativity.",
  "translation": "知道如何编码是一项非常宝贵的技能，最终可能使您赚很多钱。 使用代码赚钱有很多方法。 限制所有使用代码获利的机会的唯一原因是您自己的创造力。"
}, {
  "tag": "P",
  "text": "Most developers get inspired by the really successful companies that started out with just one developer and an idea. And that’s what most developers try to achieve accomplish as well for themselves.",
  "translation": "大多数开发人员会受到真正成功的公司的启发，这些公司最初只有一个开发人员和一个构想。 这就是大多数开发人员试图自己实现的成就。"
}, {
  "tag": "P",
  "text": "However, the odds of you building the next Facebook or Uber are not in your favor. So let’s try to focus on some more easy and realistic ways to earn money with code.",
  "translation": "但是，您建立下一个Facebook或Uber的可能性并不大。 因此，让我们尝试着重于一些更简单，更现实的方法来通过代码赚钱。"
}, {
  "tag": "P",
  "text": "That’s why we’ll be going over ten more easy and straightforward ways to make money with code in this article.",
  "translation": "这就是为什么我们将在本文中介绍十种更简单明了的方法来利用代码获利。"
}, {
  "tag": "PRE",
  "text": "(本文翻译自Daan的文章《How To Make Money With Code》，参考：https://levelup.gitconnected.com/how-to-make-money-with-code-e6bd6c698fe4)",
  "translation": "（本文翻译自Daan的文章《如何用代码赚钱》，参考：https：//levelup.gitconnected.com/how-to-make-money-with-code-e6bd6c698fe4）"
}]