[{
  "tag": "H1",
  "text": "CSS: Units Of Measurement (px, em, rem, vw, %, etc.)",
  "translation": "CSS：度量单位（px，em，rem，vw，％等）"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/0*iGQWpZ5p2R3_7rx9?q=20",
  "caption": "Photo by Charles Deluvio on Unsplash",
  "type": "image",
  "file": "0!iGQWpZ5p2R3_7rx9"
}, {
  "tag": "H1",
  "text": "Introduction",
  "translation": "介绍"
}, {
  "tag": "P",
  "text": "I decided to write this blog with the desire of exploring more about all the ways we can size things with CSS. With so many possibilities, it’s easy to feel overwhelmed and confused. There are 16 units of measurements that are currently supported by browsers: pixels, inches, picas, centimeters, millimeters, points, percentages, em, rem, viewport dimensions (vw, vh), ex, ch, Vmax (viewport max) and vmin(viewportmin) within these 16 units there are two classes: relative and absolute lengths.",
  "translation": "我决定写这个博客的目的是希望探索更多有关使用CSS调整大小的方法。 有这么多种可能性，很容易感到不知所措和困惑。 浏览器当前支持16种度量单位：像素，英寸，皮卡，厘米，毫米，点，百分比，em，rem，视口尺寸（vw，vh），ex，ch，Vmax（最大视口）和vmin （viewportmin）在这16个单位中有两类：相对长度和绝对长度。"
}, {
  "tag": "H1",
  "text": "Relative Lengths",
  "translation": "相对长度"
}, {
  "tag": "P",
  "text": "The first thing to know about relative lengths is that they get their dimensions on something else, something that is outside or relative to the elements that you are trying to size, for example, the parent’s dimensions, the font size, and the viewport dimensions.",
  "translation": "首先要了解相对长度，它们会在其他物体上获得尺寸，这些尺寸在您要设定尺寸的元素之外或相对于它们，例如，父级的尺寸，字体大小和视口尺寸。"
}, {
  "tag": "H2",
  "text": "Percentages",
  "translation": "百分比"
}, {
  "tag": "P",
  "text": "Percentages are based on their parent element. So if an element is 200px * 200px and that element had a child element that had a width of 50% and a height of 50% then the equivalent of the child’s dimensions would be 100px * 100px because 50% of 200px is 100px.",
  "translation": "百分比基于其父元素。 因此，如果一个元素为200px * 200px，并且该元素的子元素的宽度为50％，高度为50％，则该子元素的等效尺寸为100px * 100px，因为200px的50％为100px。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*EAZdIjkzju0U8irdvgmvcQ.png?q=20",
  "type": "image",
  "file": "1!EAZdIjkzju0U8irdvgmvcQ.png"
}, {
  "tag": "P",
  "text": "Here we have a div element called “parent-box” with a child div element called “child-box”.",
  "translation": "在这里，我们有一个名为“ parent-box”的div元素和一个名为“ child-box”的子div元素。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*5TJE8F90ujSn6PfKteOH-A.png?q=20",
  "type": "image",
  "file": "1!5TJE8F90ujSn6PfKteOH-A.png"
}, {
  "tag": "P",
  "text": "Here in the css file, I made the parent-box have a height and width of 200px and the child-box have a 50% width and height, that means that now the child box will be 50% of the parent-box dimensions so if the parent-box is 200px * 200px that means that the child-box will be 100px * 100px having this result:",
  "translation": "在css文件中，我将父盒的高度和宽度设置为200px，子盒的宽度和高度设置为50％，这意味着现在子盒将是父盒尺寸的50％，因此 如果父框为200px * 200px，则表示子框为100px * 100px，结果如下："
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*nysYMPsFex84IMZ5H7U12A.png?q=20",
  "type": "image",
  "file": "1!nysYMPsFex84IMZ5H7U12A.png"
}, {
  "tag": "P",
  "text": "As you can see the blue element, which is the child, is exactly 50% of the pink box, which is the parent.",
  "translation": "如您所见，蓝色元素（即子元素）正好是粉红色框（即父元素）的50％。"
}, {
  "tag": "H2",
  "text": "VIEWPORT DIMENSIONS",
  "translation": "视口尺寸"
}, {
  "tag": "P",
  "text": "There are currently four types of viewport dimension units, vw(viewport width), vh(viewport height), vmin(viewport minimum), and vmax(viewport maximum). The first thing to know when using these units is that they automatically divide the screen of your browser into a 100 x 100 invisible grid each square or unit inside that grid will represent one vw, vh, vmin, or vmax depending on the case.",
  "translation": "当前有四种类型的视口尺寸单位，vw（视口宽度），vh（视口高度），vmin（视口最小）和vmax（视口最大）。 使用这些单位时要知道的第一件事是，它们会自动将浏览器的屏幕划分为100 x 100的不可见网格，网格中的每个正方形或单位将根据情况代表一个vw，vh，vmin或vmax。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*ZitE1xcINkKiFp1H0zaV2g.png?q=20",
  "type": "image",
  "file": "1!ZitE1xcINkKiFp1H0zaV2g.png"
}, {
  "tag": "H2",
  "text": "VH & VW",
  "translation": "大众与大众"
}, {
  "tag": "P",
  "text": "So, let’s take a deeper look into these two. If we declare an element to be 50vw wide and 50vh tall we will see that the element will take precisely half of the page’s height and half of the width of the page each vw or vh will now be equivalent to one cell in that invisible 100 * 100 so if we declare an element to be 50vw it will be half of the browser’s width, let’s see an example below.",
  "translation": "因此，让我们更深入地研究这两个。 如果我们声明一个元素的宽度为50vw且高度为50vh，我们将看到该元素将恰好占据页面高度的一半，并且占据页面宽度的一半，每个vw或vh现在相当于那个不可见的100 *中的一个单元 100，所以如果我们声明一个元素为50vw，它将是浏览器宽度的一半，下面我们来看一个示例。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*N0X7UjuGRfuQ4OcErHhtkA.png?q=20",
  "type": "image",
  "file": "1!N0X7UjuGRfuQ4OcErHhtkA.png"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*wFGcId2grK7x0N_nBjDo5g.png?q=20",
  "type": "image",
  "file": "1!wFGcId2grK7x0N_nBjDo5g.png"
}, {
  "tag": "P",
  "text": "Here we see that the parent element is exactly half of the browser’s height and width.",
  "translation": "在这里，我们看到父元素恰好是浏览器高度和宽度的一半。"
}, {
  "tag": "H2",
  "text": "Vmin & Vmax",
  "translation": "Vmin和Vmax"
}, {
  "tag": "P",
  "text": "These units are a bit more tricky. So the way these units work is that the maximum or minimum length of either the height or the width is the one that will be used. For example, let us declare our parent box to have a width of 50vmax, if the width of the browser is 800px and the height is 500px then the width of the parent box is going to be 400px because the width is bigger than the height so the element will take 50 units from the invisible grid from the horizontal part of the browser, now if the height was 1000px and the width was 500px the parent box width would now be 500px because the browser’s height is now bigger than the width so the parent box will take 50 squares of the 100 squares of the vertical side of the browser and use that to declare the parent’s box width.",
  "translation": "这些单位比较棘手。 因此，这些单元的工作方式是将使用高度或宽度的最大或最小长度。 例如，让我们声明父框的宽度为50vmax，如果浏览器的宽度为800px，高度为500px，则父框的宽度为400px，因为宽度大于高度，所以 元素将从浏览器的水平部分的不可见网格中获取50个单位，现在，如果高度为1000px，宽度为500px，则父框的宽度现在为500px，因为浏览器的高度现在大于宽度，因此父元素 box将占据浏览器垂直边100平方中的50平方，并使用它来声明父对象的框宽。"
}, {
  "tag": "P",
  "text": "Now on to the vmin. Say we declare our parent’s box width to be 50vmin now the parent box width will take 50 units of the grid from the smallest viewport dimension. So same example, if the width of the browser is 800px and the height is 500px then the width of the parent box is going to be 250px now because we declared our parent box to have a width of 50 units of the smallest viewport dimension which, in this case, is the height. Now if the height was 1000px and the width was 600px the parent box width would now be 300px, I know it’s pretty confusing so let’s go back to the first example:",
  "translation": "现在进入vmin。 假设我们声明父级框的宽度为50vmin，那么从最小视口尺寸开始，父级框的宽度将占据50个网格单位。 同样的示例，如果浏览器的宽度为800px，高度为500px，则父框的宽度现在将为250px，因为我们声明父框的宽度为最小视口尺寸的50个单位， 在这种情况下，是高度。 现在，如果高度为1000像素，宽度为600像素，则父框的宽度现在为300像素，我知道这非常令人困惑，因此让我们回到第一个示例："
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*e8PvBNaVsvs-7mJhqWCdcA.png?q=20",
  "caption": "Here we declare the width to be 50vmax (50 units out of 100 from the BIGGEST viewport dimension)",
  "type": "image",
  "file": "1!e8PvBNaVsvs-7mJhqWCdcA.png"
}, {
  "tag": "P",
  "text": "So that would look like this:",
  "translation": "这样看起来像这样："
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*l-PbnO4W9CJXsiGsI6TllA.png?q=20",
  "type": "image",
  "file": "1!l-PbnO4W9CJXsiGsI6TllA.png"
}, {
  "tag": "P",
  "text": "We can see that the parent box is now exactly half of the browser’s width length, that’s because the browser’s width is bigger than the height. Now if we switched things around we would get a different result.",
  "translation": "我们可以看到父框现在恰好是浏览器宽度长度的一半，这是因为浏览器的宽度大于高度。 现在，如果我们改变一切，将会得到不同的结果。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*yxuEFlPsGo_baqVSNu_hYA.png?q=20",
  "caption": "Here we declare the width to be 50vmin (50 units out of 100 from the SMALLEST viewport dimension)",
  "type": "image",
  "file": "1!yxuEFlPsGo_baqVSNu_hYA.png"
}, {
  "tag": "P",
  "text": "So it looks like this:",
  "translation": "所以看起来像这样："
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*n4P_S-HB_OOMGveA7LDmbw.png?q=20",
  "type": "image",
  "file": "1!n4P_S-HB_OOMGveA7LDmbw.png"
}, {
  "tag": "P",
  "text": "We can see that the parent box is now exactly half of the browser’s height length, that’s because the browser’s height is smaller than the width.",
  "translation": "我们可以看到父框现在恰好是浏览器高度的一半，这是因为浏览器的高度小于宽度。"
}, {
  "tag": "H2",
  "text": "Font attribute-based units",
  "translation": "基于字体属性的单位"
}, {
  "tag": "H2",
  "text": "ex & ch",
  "translation": "事前"
}, {
  "tag": "P",
  "text": "I have never used these units but let’s see how they work. So first let’s start with ex. This unit measures the height of the letter “X” of whatever font-family you are using, what do you mean the height of the letter “X”?! So, if this “X” is 10px tall (literally the letter “X”) then 1ex will be 10px let’s say that you are using an “X” from another font-family where the “X” is 9px tall so now 1ex will be 9px.",
  "translation": "我从未使用过这些单元，但让我们看看它们是如何工作的。 所以首先让我们从ex开始。 这个单位测量您正在使用的任何字体系列的字母“ X”的高度，这是指字母“ X”的高度？ 因此，如果此“ X”的高度为10px（字面的字母为“ X”），则1ex将为10px，假设您使用的是另一个字体系列中的“ X”，其中“ X”的高度为9px，所以现在1ex 是9px。"
}, {
  "tag": "P",
  "text": "The way ch behaves is pretty similar the difference is that the length of 1ch will be based on the width of the letter “O” of a font-family so if the width of the letter “O” is 5px 1ch will be equivalent to 5px.",
  "translation": "ch的行为方式非常相似，不同之处在于1ch的长度将基于字体家族的字母“ O”的宽度，因此，如果字母“ O”的宽度为5px，则1ch将等于5px 。"
}, {
  "tag": "H2",
  "text": "em",
  "translation": "EM"
}, {
  "tag": "P",
  "text": "This unit responds to the font size of the parent element, so if the parent’s element has a font-size of 10px each em will now be equal to 10 px.",
  "translation": "此单位响应父元素的字体大小，因此，如果父元素的字体大小为10px，则每个em现在等于10 px。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*SoaWEmQ-3RCv58u097M38g.png?q=20",
  "type": "image",
  "file": "1!SoaWEmQ-3RCv58u097M38g.png"
}, {
  "tag": "P",
  "text": "Here we declare a 10px font-size inside of the parent-box and set the child’s width and height equal to 5em so if the parent element has a 10px font-size that means that each em is worth 10px so our child element would be 50px * 50px",
  "translation": "在这里，我们在父框内声明一个10px字体大小，并将子元素的宽度和高度设置为5em，因此，如果父元素的字体大小为10px，则意味着每个em值10px，因此我们的子元素将为50px * 50像素"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*U4ra3GFwYS_iUMlfF5PNKg.png?q=20",
  "type": "image",
  "file": "1!U4ra3GFwYS_iUMlfF5PNKg.png"
}, {
  "tag": "P",
  "text": "The thing with em is that they cascade, what does this mean? So if we had another element inside of the child element and also set its dimensions equal to 5em the second child will be 100px * 100px",
  "translation": "em的作用是它们级联，这意味着什么？ 因此，如果子元素内有另一个元素，并且将其尺寸设置为5em，则第二个子元素将为100px * 100px"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*gh7RGkXnRefzop-m5jH3gQ.png?q=20",
  "type": "image",
  "file": "1!gh7RGkXnRefzop-m5jH3gQ.png"
}, {
  "tag": "P",
  "text": "This happens because when there is another element inside a child the second child will multiply the value times 2, crazy right? That is why we have to be careful when working with em.",
  "translation": "发生这种情况的原因是，当一个孩子中有另一个元素时，第二个孩子会将值乘以2，疯狂吗？ 这就是为什么在使用em时我们必须小心。"
}, {
  "tag": "H2",
  "text": "rem",
  "translation": "雷姆"
}, {
  "tag": "P",
  "text": "Now rem is different than em because it takes its dimension based on the root font-size, not the parent. The word rem means “root em” this solves the problem we have with em were elements cascade, by taking its dimension based on the root the rem value will be the same throughout the whole file. So let’s see the same example but with rem.",
  "translation": "现在，rem与em有所不同，因为rem基于根字体大小而不是父字体来确定其尺寸。 rem一词的意思是“ root em”，这解决了我们在em元素级联时遇到的问题，通过基于root取其维度，rem值在整个文件中都相同。 因此，让我们看一下相同的示例，但带有rem。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*s-Akksub0gT17mUSuv6PmA.png?q=20",
  "type": "image",
  "file": "1!s-Akksub0gT17mUSuv6PmA.png"
}, {
  "tag": "P",
  "text": "So if we compare this example with the one above we can see that the font-size of the parent-box is now 30 but the first and second children have smaller sized font, also we can see that the elements don’t cascade, that is because the root is being declared with a font-size of 10px so whenever we use rem now it will always refer to 10px.",
  "translation": "因此，如果将本示例与上面的示例进行比较，我们可以看到父框的字体大小现在为30，但是第一个和第二个子控件的字体大小较小，我们还可以看到元素没有级联， 是因为以10px的字体大小声明了根，所以无论何时我们现在使用rem，它都将始终引用10px。"
}, {
  "tag": "H1",
  "text": "Absolute Lengths",
  "translation": "绝对长度"
}, {
  "tag": "P",
  "text": "Absolute lengths don’t base their size on other factors or anything else in the page, parents, viewport, etc. they base themselves on static measurements",
  "translation": "绝对长度不会根据其他因素或页面，父级，视口等其他因素来决定其大小。"
}, {
  "tag": "H2",
  "text": "Inches, centimeters, and millimeters.",
  "translation": "英寸，厘米和毫米。"
}, {
  "tag": "P",
  "text": "So I don’t feel like there is a lot to explain about these units of measurement. if you declare something to be 1in it will be 1in no matter what the size of your screen is. The same goes for centimeters and millimeters",
  "translation": "因此，我觉得关于这些度量单位的解释很多。 如果您将某物声明为1in，则无论屏幕大小如何，该值都将为1in。 厘米和毫米也一样"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*sK7mhZ7gv_m04JvcDPwNgA.png?q=20",
  "type": "image",
  "file": "1!sK7mhZ7gv_m04JvcDPwNgA.png"
}, {
  "tag": "H2",
  "text": "Points & Picas",
  "translation": "点数和Picas"
}, {
  "tag": "P",
  "text": "So points and picas are typographic terms. A point is 1/72 of an inch so it’s very small and a pica is 12 points or 1/6 of an inch.",
  "translation": "因此，积分和异食癖是印刷术语。 点是1/72英寸，因此很小，12点活字就是12点或1/6英寸。"
}, {
  "tag": "P",
  "text": "And last but not least…",
  "translation": "最后但并非最不重要…"
}, {
  "tag": "H2",
  "text": "Pixels!",
  "translation": "像素！"
}, {
  "tag": "P",
  "text": "Now pixels are absolute lengths but their size may vary depending on what device you are, some devices have bigger pixels than others depending on their density and resolution.",
  "translation": "现在，像素是绝对长度，但是它们的大小可能取决于您所使用的设备，某些设备的像素比其他设备大，这取决于它们的密度和分辨率。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*Ktk1OeIsIOqy8G4U4nclug.png?q=20",
  "type": "image",
  "file": "1!Ktk1OeIsIOqy8G4U4nclug.png"
}, {
  "tag": "PRE",
  "text": "(本文翻译自Sebastian Delima的文章《CSS: Units Of Measurement (px, em, rem, vw, %, etc.)》，参考：https://medium.com/swlh/css-units-of-measurement-px-em-rem-vw-etc-ed8522620775)",
  "translation": "（本文翻译自Sebastian Delima的文章《 CSS：测量单位（px，em，rem，vw，％等）》），参考：https：//medium.com/swlh/css-units-of-measurement- px-em-rem-vw-etc-ed8522620775）"
}]