[{
  "tag": "H1",
  "text": "7 Reasons why programmers burn out",
  "translation": "程序员倦怠的7个原因"
}, {
  "tag": "H2",
  "text": "And 7 ways to fix it",
  "translation": "以及7种修复方法"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*cZKYRLegynb1xj60k9OhPQ.jpeg?q=20",
  "caption": "Burnout is extremely common among programmers. Photo by Jacqueline Day on Unsplash",
  "type": "image",
  "file": "1!cZKYRLegynb1xj60k9OhPQ.jpeg"
}, {
  "tag": "P",
  "text": "When Jerry started their job as a junior developer, they couldn’t wait to get to work each morning. And each evening, even after their 10-hour workdays, they’d still feel energized. Now, two years later, Jerry looks like the shadow of what they used to be. Getting out of bed is hard these days, getting to work even harder. By the end of the day, they feel exhausted and drained. And they’re already dreading the thought of going back tomorrow and wasting yet another day of their lives.",
  "translation": "当杰里（Jerry）开始担任初级开发人员时，他们迫不及待地希望每天早晨上班。 而且，即使在每天工作10个小时之后，每个晚上，他们仍然会充满活力。 两年后的现在，杰瑞看上去就像是过去的影子。 这些天起床很难，而工作也变得更加艰辛。 到最后，他们感到筋疲力尽。 他们已经不敢想明天再回去，浪费自己的另一天。"
}, {
  "tag": "P",
  "text": "Sounds familiar? Personally, I have yet to meet a programmer who hasn’t been through at least one episode of burnout.",
  "translation": "听起来很熟悉？ 就我个人而言，我还没有遇到一个至少经历过一轮倦怠的程序员。"
}, {
  "tag": "P",
  "text": "It sounds paradox: The same person who fell in love with code in their teens or twenties, who have taken part in at least five hackathons over the past three years, and who contributes to open-source projects on weekends — how can this person possibly complain about burnout?",
  "translation": "这听起来很矛盾：同一个人在十几岁或二十多岁时就爱上了代码，在过去的三年中至少参加了五次黑客马拉松，并且在周末为开源项目做出了贡献-这个人怎么可能 抱怨倦怠？"
}, {
  "tag": "P",
  "text": "Yes, they can.",
  "translation": "是的他们可以。"
}, {
  "tag": "H2",
  "text": "Reason 1: Monotonous work",
  "translation": "原因1：单调的工作"
}, {
  "tag": "P",
  "text": "Programming is sitting in front of a screen all day, except maybe for a lunch break and a few meetings here and there. Sure, it’s the same in many other jobs. But the intensity of staring-at-your-screen-while-sitting-in-a-very-unhealthy-position is highest in programming.",
  "translation": "编程整天坐在屏幕前，除了午休时间和在这里和那里的一些会议。 当然，在其他许多工作中也是如此。 但是，在编程中，坐在一个非常不健康的位置时凝视屏幕的强度是最高的。"
}, {
  "tag": "P",
  "text": "Even if you find your work mentally stimulating, this monotony can quickly lead to physical sluggishness. Which means that you don’t get your work done as fast, so you start getting demotivated, so you work less, …",
  "translation": "即使您发现自己的工作在精神上令人振奋，但这种单调的情绪也会很快导致身体呆滞。 这意味着您无法以最快的速度完成工作，因此您开始精神消沉，因此工作量减少了……"
}, {
  "tag": "P",
  "text": "Getting out of this vicious cycle means adopting a healthy lifestyle. Which sounds easy in theory. But the declining rates of life expectancy show how hard it is.",
  "translation": "摆脱这种恶性循环意味着采取健康的生活方式。 从理论上讲，这听起来很容易。 但是，预期寿命的下降表明了预期的艰辛程度。"
}, {
  "tag": "H2",
  "text": "How Fitness Transformed Me into a Better Web Developer",
  "translation": "Fitness如何将我转变为更好的Web开发人员"
}, {
  "tag": "H3",
  "text": "Running for better runtime",
  "translation": "运行以获得更好的运行时间"
}, {
  "tag": "H2",
  "text": "Reason 2: Rushing for deadlines",
  "translation": "原因2：赶时间"
}, {
  "tag": "P",
  "text": "If you’ve ever worked with Scrum and similar methodologies, or if you have an ambitious manager, you know what I’m talking about.",
  "translation": "如果您曾经使用过Scrum和类似的方法，或者如果您有雄心勃勃的经理，那么您就会知道我在说什么。"
}, {
  "tag": "H2",
  "text": "A Short Introduction to the Scrum Methodology",
  "translation": "Scrum方法论简介"
}, {
  "tag": "H3",
  "text": "Or How I Learned to Embrace Change",
  "translation": "或我如何学会拥抱变化"
}, {
  "tag": "P",
  "text": "You’re chasing deadline after deadline. You’re probably missing a few deadlines along the way. You’re expected to deliver everything by yesterday, and nobody cares that humans aren’t capable of that.",
  "translation": "您正在逐个期限地追求期限。 您可能会错过一些截止日期。 预计您会在昨天之前交付所有东西，而且没人会在乎人类没有能力做到这一点。"
}, {
  "tag": "P",
  "text": "As a result, when you’re thinking about your work, you’re not feeling a sense of joy or accomplishment. You’re feeling pressure.",
  "translation": "因此，在考虑工作时，不会感到喜悦或成就感。 您感到压力。"
}, {
  "tag": "P",
  "text": "And that sucks all passion for coding out of you. You’re expected to be a robot that always generates top-notch output and delivers it ahead of time. But you’re human, so you respond with symptoms of burnout.",
  "translation": "这就使您对编码的所有热情都荡然无存。 您应该是一个始终会产生一流输出并提前交付的机器人。 但是你是人类，所以你会出现倦怠的症状。"
}, {
  "tag": "H2",
  "text": "Reason 3: Coworkers that suck",
  "translation": "原因3：吸吮的同事"
}, {
  "tag": "P",
  "text": "Consider the following situation: Your project is exciting you and you feel you’re making progress on it. Still, every day you dread going to work. The simple thought of it is making you anxious and unhappy. What’s wrong?",
  "translation": "考虑以下情况：您的项目令人兴奋，并且您感到自己正在取得进展。 尽管如此，每天您都害怕上班。 简单的想法就是让您感到焦虑和不快乐。 怎么了？"
}, {
  "tag": "P",
  "text": "Of course, your happiness at work is influenced by — well — your work. But even more importantly, your happiness is influenced by your relationships — in or outside of work.",
  "translation": "当然，您的工作幸福感受您的工作影响。 但更重要的是，工作中或工作之外，人际关系影响着你的幸福。"
}, {
  "tag": "P",
  "text": "So if you’re happy with what you’re doing but you’re still dreading it, it’s probably your coworkers. No matter whether they just don’t share your values or whether the corporate culture makes them act in stupid ways — you don’t deserve to be treated nastily.",
  "translation": "因此，如果您对自己的工作感到满意，但仍然感到恐惧，那可能是您的同事。 无论他们只是不分享您的价值观，还是公司文化是否使他们以愚蠢的方式行事-您都不应该受到侮辱。"
}, {
  "tag": "P",
  "text": "If you’re experiencing burnout symptoms that result from icky coworkers, know that it’s not your fault. You might want to try some of the fixes listed further on in this article. Or you might want to go a bit more radical and change departments or get a job with a different company entirely.",
  "translation": "如果您遇到讨厌的同事引起的倦怠症状，请注意这不是您的错。 您可能想尝试本文中进一步列出的一些修复程序。 或者，您可能想更加激进一些，更换部门或完全在另一家公司工作。"
}, {
  "tag": "P",
  "text": "It’s up to you. Just know that you deserve better.",
  "translation": "由你决定。 只知道你应该得到更好。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*ExWnXfdp51m-JRsirvHWag.jpeg?q=20",
  "caption": "Your job will suck if your coworkers don’t share your values. Photo by Ali Yahya on Unsplash",
  "type": "image",
  "file": "1!ExWnXfdp51m-JRsirvHWag.jpeg"
}, {
  "tag": "H2",
  "text": "Reason 4: No recognition",
  "translation": "原因4：无法识别"
}, {
  "tag": "P",
  "text": "This part is related to your at-work relationships, but on another level. Your project may be wonderful and exciting, and your colleagues may be awesome.",
  "translation": "这一部分与您的工作关系有关，但在另一个层面上。 您的项目可能很棒，令人兴奋，而您的同事可能很棒。"
}, {
  "tag": "P",
  "text": "But whenever you feel like you’ve achieved something, your manager comes around the corner with a totally different task. And every time they do that, the old task becomes completely irrelevant.",
  "translation": "但是，只要您觉得自己有所成就，经理就可以完成完全不同的任务。 而且每次他们这样做时，旧任务就变得完全无关紧要。"
}, {
  "tag": "P",
  "text": "Sounds familiar? I know it does to me.",
  "translation": "听起来很熟悉？ 我知道对我有用。"
}, {
  "tag": "P",
  "text": "You can be as excited or passionate as you like about your field. If your work constantly gets invalidated, you’ll lose your motivation.",
  "translation": "您可以对自己的领域感到兴奋或热情。 如果您的工作不断失效，您就会失去动力。"
}, {
  "tag": "P",
  "text": "You’ll start dreading to go there because you know you won’t create anything useful anyway. You’ll be happy when the day is over — because it’s over — but unhappy since it isn’t Friday and you’ll have to go to work again tomorrow. And at some point, you’ll start thinking that even the skills that you’re acquiring by completing your tasks are irrelevant.",
  "translation": "您将开始害怕去那里，因为您知道您将不会创建任何有用的东西。 一天结束了，您会很高兴-因为已经过去了-但由于不是星期五，所以您会很不高兴，明天您将不得不再次上班。 在某个时候，您会开始认为，即使您通过完成任务所获得的技能也无关紧要。"
}, {
  "tag": "P",
  "text": "With time, this can lead to more severe symptoms. All because your manager has no idea what you should be doing.",
  "translation": "随着时间的流逝，这可能导致更严重的症状。 都是因为您的经理不知道您应该做什么。"
}, {
  "tag": "H2",
  "text": "Reason 5: Getting paid",
  "translation": "原因5：获得报酬"
}, {
  "tag": "P",
  "text": "Getting paid too little — or too much! — can worsen your symptoms of burnout.",
  "translation": "报酬太少-或太多！ -会使您的倦怠症状恶化。"
}, {
  "tag": "P",
  "text": "Too little pay is a no-brainer for burnout. (Yes, broke programmers exist!) If your passion for coding isn’t enough to keep food on the table, you might not feel like your work is valued. Which brings us back to reason 4.",
  "translation": "薪水太少毫无倦怠之情。 （是的，存在破产的程序员！）如果您对编码的热情还不足以让您一饱眼福，那么您可能会觉得自己的工作不那么有价值。 这使我们回到了原因4。"
}, {
  "tag": "P",
  "text": "But burnout can also worsen when you get paid too much. While a big check sounds great in theory, it can lead to disaster in real life. Let me illustrate this with my personal experience.",
  "translation": "但是，当您获得过多报酬时，倦怠也可能恶化。 从理论上讲，大检查听起来不错，但它可能导致现实生活中的灾难。 让我用我的亲身经历来说明这一点。"
}, {
  "tag": "P",
  "text": "As an undergraduate, I got very involved in programming. I’d spend days and nights at the research lab coding software for scientific purposes, sometimes even neglecting my coursework for it. I loved it so much that I never expected any compensation for it. For years I worked for free. Even if that meant that I couldn’t even afford tomatoes at the supermarket.",
  "translation": "作为一名本科生，我非常参与编程。 我出于科学目的在研究实验室编码软件上昼夜不休，有时甚至忽略了我的课程。 我非常喜欢它，以至于我从未期望对此有任何补偿。 多年来我一直免费工作。 即使那意味着我什至无法在超市买得起西红柿。"
}, {
  "tag": "P",
  "text": "This radically changed when I entered grad school. Suddenly I was being paid. Suddenly all my bills were covered. Suddenly I could buy tomatoes without having to think about the pennies. I was making a living. Of code!",
  "translation": "当我进入研究生院时，情况发生了根本变化。 突然我得到了报酬。 突然我的所有账单都被支付了。 突然，我可以不用考虑几分钱就能买到西红柿了。 我以谋生为生。 代码！"
}, {
  "tag": "P",
  "text": "And then a silly idea entered my mind: If I was being paid to code, then each month I should be delivering a piece of code that is worth at least that amount of money.",
  "translation": "然后我想到一个愚蠢的主意：如果我被要求支付代码，那么每个月我应该交付一段至少值那笔钱的代码。"
}, {
  "tag": "P",
  "text": "Suddenly what had started as a wild passion became a source of pressure. Pressure to deliver. Pressure to perform. Pressure to give back the value that I was receiving in money.",
  "translation": "突然，从狂放的激情开始的事情变成了压力的来源。 交付压力。 执行压力。 要求退还我所获得的金钱价值的压力。"
}, {
  "tag": "P",
  "text": "But the more you pressure yourself, the less you’re going to perform. Especially when you’re thinking about money.",
  "translation": "但是，您对自己施加的压力越大，您要做的事情就越少。 特别是在考虑金钱时。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*_8aoMOhpnnak7cyEZSHCkA.jpeg?q=20",
  "caption": "Drowning in your tasks is a recipe for disaster. Photo by nikko macaspac on Unsplash",
  "type": "image",
  "file": "1!_8aoMOhpnnak7cyEZSHCkA.jpeg"
}, {
  "tag": "H2",
  "text": "Reason 6: Meaningless tasks",
  "translation": "原因6：毫无意义的任务"
}, {
  "tag": "P",
  "text": "Reasons 3 to 5 tackle problems that you might encounter despite having a great project. But sometimes your project just sucks.",
  "translation": "原因3到5解决了尽管拥有一个出色的项目您可能会遇到的问题。 但是有时候您的项目很糟糕。"
}, {
  "tag": "P",
  "text": "Maybe your project is just a heap of corporate B.S. with not much substance for a programmer. All you want is to code, and not take care of all the managerial duties, customer relations and so on.",
  "translation": "也许您的项目只是企业B.S. 对程序员来说没有太多的实质。 您只需要编写代码，而不要处理所有管理职责，客户关系等。"
}, {
  "tag": "H2",
  "text": "What every Data Scientist needs to learn from Business Leaders",
  "translation": "每位数据科学家需要向企业领导者学习什么"
}, {
  "tag": "H3",
  "text": "Because soft skills matter.",
  "translation": "因为软技能很重要。"
}, {
  "tag": "P",
  "text": "Maybe you’re not seeing the meaning in your project because you can’t learn anything new from it. Programmers belong to the most curious creatures on this planet — if you can’t learn from it, you don’t like it.",
  "translation": "也许您没有在项目中看到含义，因为您无法从项目中学到任何东西。 程序员属于这个星球上最好奇的生物-如果您不能从中学到东西，就不会喜欢它。"
}, {
  "tag": "P",
  "text": "Maybe the project seems way beyond your skills. You feel that you’re unable to master it, and that your manager completely over-estimated your skills.",
  "translation": "也许该项目似乎超出了您的技能范围。 您觉得自己无法掌握它，而经理却完全高估了自己的技能。"
}, {
  "tag": "P",
  "text": "Or maybe you’ve been working on a project for the past few months, and you still can’t fathom what you’re supposed to be doing. The task is a mystery and nobody seems able to explain it to you. This usually stems from mismanagement. Unfortunately, this situation happens more often than you think.",
  "translation": "或者，也许您在过去的几个月中一直在从事一个项目，但是您仍然无法理解应该做的事情。 这项任务是一个谜，似乎没人能向您解释。 这通常是由于管理不善造成的。 不幸的是，这种情况比您想像的更多。"
}, {
  "tag": "P",
  "text": "In any case, from a corporate perspective, your project is your main reason to work. So if it sucks, no wonder you’re experiencing burnout.",
  "translation": "无论如何，从公司的角度来看，您的项目是您工作的主要原因。 因此，如果糟透了，也难怪您会精疲力尽。"
}, {
  "tag": "H2",
  "text": "Reason 7: Walking the death march",
  "translation": "原因7：走向死亡"
}, {
  "tag": "P",
  "text": "This one is closely related to reason 6. The death march, in short, is when you’re working on a project that is destined to fail.",
  "translation": "这与原因6密切相关。简而言之，死亡行军是指您要注定要失败的项目。"
}, {
  "tag": "P",
  "text": "This can have many reasons: The deadline is too tight, you don’t have enough resources, or your team is too small to carry it out. Especially when it’s a big project that you’re working on for many months, and when the stakes are high, this can lead to a huge amount of pressure on your shoulders.",
  "translation": "这可能有许多原因：截止日期太紧，您没有足够的资源或团队太小而无法执行。 特别是当这是一个您要工作数月的大型项目，并且风险很高时，这可能会给您带来巨大的压力。"
}, {
  "tag": "P",
  "text": "Your reaction to this can go both ways: Either you sink into complete apathy, come in late and leave early because you know that your work isn’t going to change anything. Or you start putting in 14-hour days in the belief that this way you could turn things around.",
  "translation": "您对此的反应可能有两种：要么完全陷入冷漠，要么迟到早退，因为您知道自己的工作不会改变任何事情。 或者您开始投入14小时的工作日，以为您可以扭转局面。"
}, {
  "tag": "P",
  "text": "Your apathy is caused by demotivation and leads to more demotivation. You’re basically removing the fuel that keeps your fire going.",
  "translation": "你的冷漠是由动机引起的，并导致更多的动机。 基本上，您正在清除使火势持续的燃料。"
}, {
  "tag": "P",
  "text": "Or if you’re the type that gets buried in their work, you’re literally suffocating your passion with all the time you’re investing into it.",
  "translation": "或者，如果您是沉迷于他们的工作中的那种类型，那么您在投资上的所有时间实际上就会窒息您的激情。"
}, {
  "tag": "P",
  "text": "Both of these are natural responses. As before, just know that if the project isn’t going well, it’s not your fault. You’re an excellent programmer and you’ve probably proven that on other projects. If this is going wrong, it’s because of the circumstances and not because of you!",
  "translation": "这些都是自然的反应。 和以前一样，只要知道项目进展顺利，那不是你的错。 您是一位出色的程序员，并且可能已经在其他项目中证明了这一点。 如果出问题了，那是因为情况，而不是因为您！"
}, {
  "tag": "H2",
  "text": "A Programmer Burnout Story; How to Recognize it And Avoid it | CoderHood",
  "translation": "程序员倦怠的故事； 如何识别和避免它 CoderHood"
}, {
  "tag": "H3",
  "text": "I'll tell you a story of a software engineer named Bolbo, who at some point in his career got caught up in a death march.",
  "translation": "我将告诉您一个名为Bolbo的软件工程师的故事，他在职业生涯中的某个时刻陷入了死亡大游行。"
}, {
  "tag": "H2",
  "text": "Programmers are no robots",
  "translation": "程序员不是机器人"
}, {
  "tag": "P",
  "text": "The tricky part about burnout is that what starts as a work problem splashes over to all areas of life. You start neglecting your family, your friends, your hobbies, and your self-care. And suddenly you’re not caught in a work crisis, but a life crisis.",
  "translation": "关于倦怠的棘手部分是，从工作问题开始就蔓延到生活的各个领域。 您开始忽视家人，朋友，爱好和自我照顾。 突然之间，您没有陷入工作危机，而是生活危机。"
}, {
  "tag": "P",
  "text": "It is vital to understand that — and I can’t stress this enough — this is not your fault. Sure, recognizing your own mistakes is vital for personal growth. But blaming yourself for mistakes you haven’t made will ruin you.",
  "translation": "了解这一点非常重要-我不能对此施加太大压力-这不是您的错。 当然，认识到自己的错误对于个人成长至关重要。 但是，责怪自己没有犯的错误会毁了你。"
}, {
  "tag": "P",
  "text": "Most of the time, the root of the problem of programmer’s burnout is within the company culture or some form of mismanagement.",
  "translation": "大多数时候，程序员倦怠问题的根源在于公司文化或某种形式的管理不善。"
}, {
  "tag": "P",
  "text": "That doesn’t mean that you need to change departments or quit your job right away. While this might be a good solution for the really hard cases, working with a few softer fixes can already do tremendous help.",
  "translation": "这并不意味着您需要立即更换部门或辞职。 尽管这对于真正困难的情况可能是一个很好的解决方案，但是使用一些更小的修补程序已经可以提供巨大的帮助。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*zJUZB-cJ6fU4xm-6scfUyg.jpeg?q=20",
  "caption": "Compassion is key. Photo by Jude Beck on Unsplash",
  "type": "image",
  "file": "1!zJUZB-cJ6fU4xm-6scfUyg.jpeg"
}, {
  "tag": "H2",
  "text": "Fix 1: Be compassionate with yourself",
  "translation": "修复1：同情自己"
}, {
  "tag": "P",
  "text": "I know this sounds lame. But hear me out.",
  "translation": "我知道这听起来很la脚。 但是，请听我说。"
}, {
  "tag": "P",
  "text": "Burnout is not your fault. It is not a symptom of weakness. The pain you’re experiencing is not from being an idiot. It is real. It is valid.",
  "translation": "倦怠不是你的错。 这不是软弱的征兆。 您所经历的痛苦不是白痴。 是真的。 是有效的。"
}, {
  "tag": "P",
  "text": "I stress this so much because I’m a culprit of this fallacy. I tend to blame myself for issues that I didn’t cause and beat myself up when I should be nice to myself.",
  "translation": "我这么强调是因为我是这种谬论的罪魁祸首。 我倾向于怪我自己没有引起的问题，当我应该对自己好时就把自己殴打。"
}, {
  "tag": "P",
  "text": "Being compassionate with oneself is something that I’m still learning. But the one thing I’ve found is that this helps:",
  "translation": "对自己有同情心是我仍在学习的东西。 但我发现的一件事是，这样做有帮助："
}, {
  "tag": "P",
  "text": "Be your own best friend.",
  "translation": "成为自己最好的朋友。"
}, {
  "tag": "P",
  "text": "This doesn’t mean you shouldn’t keep in regular contact with your besties. But try to treat yourself like your best friend.",
  "translation": "这并不意味着您不应该经常与同伴保持联系。 但是，请尽量把自己当作最好的朋友。"
}, {
  "tag": "P",
  "text": "When you’re beating yourself up for your apparent ignorance, incompetence or whatever, think of this: What would you tell your best friend if they were in your situation? How would you talk to them?",
  "translation": "当您因明显的无知，无能或其他原因而殴打自己时，请考虑一下：如果最好的朋友遇到您，您将如何告诉他们？ 您将如何与他们交谈？"
}, {
  "tag": "P",
  "text": "Self-compassion, I have found, is an incredible hack for gaining more self-love. And that leads to — you guessed it — more happiness and productivity.",
  "translation": "我发现自我同情是获得更多自我爱的不可思议的技巧。 这使您猜对了，从而带来了更多的幸福感和生产力。"
}, {
  "tag": "H2",
  "text": "The Secret to Happiness is Compassion",
  "translation": "幸福的秘诀是同情心"
}, {
  "tag": "H3",
  "text": "Be Compassionate, Be Happy",
  "translation": "有同情心，要快乐"
}, {
  "tag": "H2",
  "text": "Fix 2: Think about what used to excite you",
  "translation": "修正2：想想曾经让您兴奋的原因"
}, {
  "tag": "P",
  "text": "I used to be so excited about programming, but I lost the spark when I entered grad school. For me the reason was that I was getting paid (reason 5); but for you, it might be any of the reasons stated above.",
  "translation": "我曾经对编程感到非常兴奋，但是当我进入研究生院时，我失去了火花。 对我来说，原因是我得到了报酬（原因5）； 但对您而言，可能是上述任何原因。"
}, {
  "tag": "P",
  "text": "What helped were the memoirs of Nobel prize winning physicist Richard Feynman, who was going through a period of burn-out when he received a job offer from the very renowned Institute of Advanced Study:",
  "translation": "诺贝尔奖获得者物理学家理查德·费曼（Richard Feynman）的回忆录有所帮助，当他从著名的高等研究院获得工作机会时，正经历一段疲倦："
}, {
  "tag": "P",
  "text": "Institute for Advanced Study! Special exception! A position better than Einstein, even! It was ideal; it was perfect; it was absurd!",
  "translation": "进修学院！ 特别例外！ 甚至比爱因斯坦还好！ 这是理想的； 它是完美的; 太荒谬了！"
}, {
  "tag": "P",
  "text": "It was absurd. The other offers had made me feel worse, up to a point. They were expecting me to accomplish something. But this offer was so ridiculous, so impossible for me ever to live up to, so ridiculously out of proportion. […] I laughed at it while I was shaving, thinking about it.",
  "translation": "太荒谬了。 在其他方面，其他提议使我感到更糟。 他们期望我有所成就。 但是这个提议太荒谬了，以至于我无法辜负，太离谱了。 […]我剃须时嘲笑它，想着它。"
}, {
  "tag": "P",
  "text": "And then I thought to myself, “You know, what they think of you is so fantastic, it’s impossible to live up to it. You have no responsibility to live up to it!”",
  "translation": "然后我对自己心想：“你知道，他们对你的想法真是太棒了，不可能实现。 您没有辜负它的责任！”"
}, {
  "tag": "P",
  "text": "It was a brilliant idea: You have no responsibility to live up to what other people think you ought to accomplish. I have no responsibility to be like they expect me to be. It’s their mistake, not my failing.",
  "translation": "这是一个绝妙的主意：您没有责任实现别人认为您应该实现的目标。 我没有责任像他们期望的那样。 这是他们的错误，不是我的失败。"
}, {
  "tag": "P",
  "text": "It wasn’t a failure on my part that the Institute for Advanced Study expected me to be that good; it was impossible. It was clearly a mistake ­­ and the moment I appreciated the possibility that they might be wrong, I realized that it was also true of all the other places, including my own university. I am what I am, and if they expected me to be good and they’re offering me some money for it, it’s their hard luck.",
  "translation": "对我来说，高等研究院希望我表现得这么好并不是失败。 这是不可能的。 显然这是一个错误-，当我意识到它们可能出错的那一刻，我意识到在包括我自己的大学在内的所有其他地方也是如此。 我就是我，如果他们希望我表现出色，并且为此提供了一些钱，那将是他们的不幸。"
}, {
  "tag": "P",
  "text": "— From “Surely you’re joking, Mr. Feynman”, by Richard Feynman, Copyright 1985, pg. 100.",
  "translation": "—摘自Richard Feynman的“您肯定是在开玩笑，Feynman先生”，版权所有1985，第16页。 100"
}, {
  "tag": "P",
  "text": "Feynman wasn’t exactly coding. Still, it is this text that got me out of my rabbit hole at the beginning of my PhD. From it I concluded, if my doctorate school is overpaying me — then it’s their fault. I’ll be irresponsible like Mr Feynman and do whatever the hell I like. And I did.",
  "translation": "Feynman并没有完全编码。 尽管如此，正是这段文字使我在博士开始之初就脱离了兔子洞。 由此得出的结论是，如果我的博士学位学校超额支付我–那是他们的错。 我会像费曼先生那样不负责任，不管我喜欢做什么。 而我做到了。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*KmKv-E6RKFFBKz147zrD9Q.jpeg?q=20",
  "caption": "Do the small tasks first, then reach for higher goals. Photo by Brad Barmore on Unsplash",
  "type": "image",
  "file": "1!KmKv-E6RKFFBKz147zrD9Q.jpeg"
}, {
  "tag": "H2",
  "text": "Fix 3: Incorporate routine tasks",
  "translation": "修复3：合并例行任务"
}, {
  "tag": "P",
  "text": "Having to go to work when you know you’ll get nothing done is daunting. By definition.",
  "translation": "当您知道自己一无所获时，必须去上班是艰巨的。 根据定义。"
}, {
  "tag": "P",
  "text": "No matter whether the project is too hard, or mismanaged, or completely meaningless — you’ll have to go without that dopamine surge that gives you your happy groove.",
  "translation": "无论项目是太艰巨，管理不当还是完全没有意义，您都必须避免多巴胺激增，这会让您感到高兴。"
}, {
  "tag": "P",
  "text": "One thing that can help reset your motivation is incorporating routine tasks. I like to start my workday with something easy, almost trivial. The task should be useful, but the main object is to get a tick off my todo-list.",
  "translation": "可以帮助您重新设置动机的一件事是纳入常规任务。 我喜欢从简单，几乎琐碎的事情开始我的工作。 该任务应该很有用，但主要目的是勾勒我的待办事项清单。"
}, {
  "tag": "P",
  "text": "This tricks my monkey-brain into wanting to fulfill the next task — because then I’ll get another moment of accomplishment. I then slowly go from the easiest to the hardest parts.",
  "translation": "这使我的猴子脑子想完成下一个任务-因为那样我会再获得成就。 然后，我慢慢地从最简单的部分转到最困难的部分。"
}, {
  "tag": "P",
  "text": "It sounds like procrastination of the difficult stuff. But it works! I’m surprised quite regularly about how much I actually get done by doing the easy things first.",
  "translation": "听起来像是拖延了困难的事情。 但这有效！ 我经常会感到惊讶，首先要做些简单的事情实际上能完成多少工作。"
}, {
  "tag": "H2",
  "text": "Fix 4: Reflect",
  "translation": "修复4：反映"
}, {
  "tag": "P",
  "text": "Set some time aside each day to practice some reflection. Everybody has their own technique, and you’re free to develop yours. I use a reflection matrix that I fill each evening:",
  "translation": "每天留出一些时间练习反思。 每个人都有自己的技术，您可以自由发展自己的技术。 我使用每天晚上填充的反射矩阵："
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*McyhA5eNqDJSl4oomgjVWw.jpeg?q=20",
  "type": "image",
  "file": "1!McyhA5eNqDJSl4oomgjVWw.jpeg"
}, {
  "tag": "P",
  "text": "I separate active events from passive ones. An active event is a direct consequence of what I did. A passive event is something that happens without me doing anything. This helps me realize that not everything is in my control.",
  "translation": "我将主动事件与被动事件分开。 活动是我所做的直接结果。 被动事件是没有我做任何事情而发生的事情。 这可以帮助我意识到，并非所有事情都在我的掌控之中。"
}, {
  "tag": "P",
  "text": "In the “I like” category I write things that I’m grateful for that day. This builds my feeling of accomplishment and my mental resilience. This way I’m being proactive against demotivation.",
  "translation": "在“我喜欢”类别中，我写了我为那天感激的东西。 这增强了我的成就感和精神韧性。 这样，我就可以积极主动地抵制挫败感。"
}, {
  "tag": "P",
  "text": "And the “I wish” category contains things that could have been better. This is where I draw lessons and search for solutions — for example, I might set my milestones differently or search for new ways to cope with my injury.",
  "translation": "“我希望”类别包含的东西本来可以更好。 这是我汲取教训并寻求解决方案的地方-例如，我可能会设定不同的里程碑或寻找新方法来应对伤害。"
}, {
  "tag": "H2",
  "text": "Minimalist Journaling: A Fun and Effective Tool for Tremendous Habit Change",
  "translation": "极简主义日记：一种巨大习惯的有趣有效工具"
}, {
  "tag": "H3",
  "text": "How to create your own habit dashboard that motivates you to stick to any habit",
  "translation": "如何创建自己的习惯仪表板，激发您坚持任何习惯"
}, {
  "tag": "P",
  "text": "You can reflect using a journal, or by talking to a friend, or sending emails to yourself. I advise you against doing it solely in your head — because you’ll forget about it and it will be harder to build a habit. Also, the backlog will be fun to look through later, believe it or not.",
  "translation": "您可以使用日记，与朋友交谈或向自己发送电子邮件进行反思。 我建议您不要只在脑子里这样做，因为您会忘记它，而且养成习惯会更困难。 另外，无论您是否相信，积压的内容都会在以后浏览时很有趣。"
}, {
  "tag": "P",
  "text": "You can do this wherever you want — in your office, at home or in the park. But try to do it in the same place each day — this will help you build a habit. Also, try to do it at the same time each day, and ideally block this time out in your calendar."
}, {
  "tag": "P",
  "text": "By reflecting, you’re looking back on your past success. And you’re realizing that every so often, you’re not in control of things. This has helped me a lot in coping with symptoms of burnout.",
  "translation": "通过反思，您正在回顾过去的成功。 而且您意识到，每时每刻，您都无法控制事情。 这对我解决倦怠症状很有帮助。"
}, {
  "tag": "H2",
  "text": "Fix 5: Get a hobby",
  "translation": "修复5：业余爱好"
}, {
  "tag": "P",
  "text": "You’re a programmer. You’re a geek. I get it.",
  "translation": "您是一名程序员。 你是个极客。 我知道了。"
}, {
  "tag": "P",
  "text": "When you’re not at work, you’re either sleeping or coding for fun. And that’s amazing.",
  "translation": "当您不上班时，您正在睡觉或编码以娱乐。 这太神奇了。"
}, {
  "tag": "P",
  "text": "But when you face serious burnout, you might not feel like touching a computer at all. And now you’re faced with a big fat emptiness in your life.",
  "translation": "但是，当您面临严重的倦怠时，您可能根本不想触摸计算机。 现在，您一生面临巨大的空虚。"
}, {
  "tag": "P",
  "text": "Be proactive about that and get an activity going on the side — preferably one that doesn’t involve computers. It could be a sport, or music, or cooking, or interior design. Find something that you’re interested in — and do that on a regular basis."
}, {
  "tag": "P",
  "text": "One thing that helps me is having a hobby that is useful in a practical way. For example, at least once a week, I like to cook something delicious. It’s easy for me to keep that up because I need to eat anyway. Plus, this way I’m ensuring that I’m getting something healthy, which has positive effects back to my work.",
  "translation": "帮助我的一件事是拥有一种实用的爱好。 例如，我每周至少要烹饪一次美味的东西。 我很容易坚持下去，因为我仍然需要吃饭。 另外，通过这种方式，我可以确保自己得到一些健康的东西，这对我的工作有积极的影响。"
}, {
  "tag": "P",
  "text": "Whatever you choose to do, any hobby or side project will give you a sense of accomplishment that you’re lacking at work. A hobby helps stabilize you so that a work crisis doesn’t become a life crisis.",
  "translation": "无论您选择做什么，任何业余爱好或附带项目都会给您带来工作上缺乏的成就感。 爱好可以帮助您稳定生活，使工作危机不会变成生活危机。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*8vzT7_58IcgPsjdaDQZ-nw.jpeg?q=20",
  "caption": "Get a hobby that inspires you. Photo by freestocks on Unsplash",
  "type": "image",
  "file": "1!8vzT7_58IcgPsjdaDQZ-nw.jpeg"
}, {
  "tag": "H2",
  "text": "Fix 6: Set non-negotiable boundaries",
  "translation": "修复6：设置不可协商的边界"
}, {
  "tag": "P",
  "text": "This one is for those who over-compensate when they’re burnt out. As paradox as it sounds, getting free time can require some discipline, too.",
  "translation": "这是针对那些精疲力尽时过度补偿的人的。 听起来很矛盾，获得空闲时间也可能需要纪律。"
}, {
  "tag": "P",
  "text": "For example, I have a boundary that I do nothing productive — coding or Medium or whatever — after 9 P.M. I’ve had this boundary for the last five years and I’ve only crossed it twice."
}, {
  "tag": "P",
  "text": "Not only does it help me wind down, reflect and get a good night’s sleep. It also gives me something to look forward to during the day. No matter how stressful life is, I know I’ll always be able to switch my mind off between 9 P.M. and the moment I go to bed.",
  "translation": "它不仅可以帮助我放松，反射并获得良好的睡眠。 这也给了我一天期待的东西。 无论生活有多紧张，我都知道我总是可以在晚上9点之间改变主意。 我上床的那一刻"
}, {
  "tag": "H2",
  "text": "Why Your Brain Needs Idle Time",
  "translation": "为什么您的大脑需要空闲时间"
}, {
  "tag": "H3",
  "text": "Some vital brain functions demand downtime",
  "translation": "一些重要的大脑功能需要停机"
}, {
  "tag": "P",
  "text": "The important part is that these boundaries are not flexible. Blocking them out in your calendar and clearly communicating them with your boss and your colleagues will help you maintain them."
}, {
  "tag": "P",
  "text": "You might be afraid that you’ll seem lazy. Funnily enough, this is not the case. A person with clear boundaries makes the impression that they’re in control of their lives.",
  "translation": "您可能会担心自己会变得懒惰。 有趣的是，事实并非如此。 界限清晰的人给人的印象是，他们可以控制自己的生活。"
}, {
  "tag": "H2",
  "text": "Fix 7: Advocate for yourself",
  "translation": "修正7：为自己辩护"
}, {
  "tag": "P",
  "text": "This links directly to the above. Clearly communicate what you need — your boundaries, but also any additional resources, manpower and money that is needed to achieve the goal of your project.",
  "translation": "这直接链接到上面。 清楚地传达您的需求-您的界限，以及实现项目目标所需的任何其他资源，人力和金钱。"
}, {
  "tag": "P",
  "text": "What you need should be well-reasoned — otherwise, your manager might think you’re too demanding. But it’s still better to come off as demanding than being too shy to express what you want. The others can’t read that off the tip of your nose.",
  "translation": "您所需要的应该合理，否则，您的经理可能会认为您要求过高。 但是，最好不要苛刻地离开，而不要害羞地表达自己想要的东西。 其他人看不懂你的鼻子。"
}, {
  "tag": "P",
  "text": "Once you start building a habit of expressing what you need, you’ll be surprised at the number of things that people will do to help you!",
  "translation": "一旦开始养成表达需求的习惯，您会惊讶于人们会为您提供帮助的事情！"
}, {
  "tag": "H2",
  "text": "Final words: You’re not alone",
  "translation": "最后一句话：您并不孤单"
}, {
  "tag": "P",
  "text": "As I have mentioned earlier, I have yet to meet a programmer who hasn’t experienced a major period of burnout at some point in their career. So if this article teaches you one thing, it should be that you’re not an isolated case.",
  "translation": "正如我之前提到的，我还没有遇到一个程序员，他在职业生涯的某个阶段还没有经历过长时间的倦怠。 因此，如果本文告诉您一件事，那就应该是您不是一个孤立的案例。"
}, {
  "tag": "P",
  "text": "Treat yourself and the others with care, and know that whatever is bringing you down at the moment, it is not your fault.",
  "translation": "细心对待自己和他人，并知道当下令您失望的并不是您的错。"
}, {
  "tag": "PRE",
  "text": "(本文翻译自Rhea Moutafis的文章《7 Reasons why programmers burn out》，参考：https://towardsdatascience.com/7-reasons-why-programmers-burn-out-44a40bf8948d)"
}]