[{
  "tag": "H1",
  "text": "11 best Data Science classes if you’re locked home because of coronavirus",
  "translation": "如果您因冠状病毒而被锁在家中，则有11种最好的数据科学课程"
}, {
  "tag": "H2",
  "text": "Kickstart your career without spending a dime",
  "translation": "不花一分钱就可以开始事业"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*iE5NxLhVgf2WgyNHij4lZQ.jpeg?q=20",
  "caption": "If you have too much time at home, why not invest it in your skills? Photo by Grzegorz Walczak on Unsplash",
  "type": "image",
  "file": "1!iE5NxLhVgf2WgyNHij4lZQ.jpeg"
}, {
  "tag": "P",
  "text": "Shakespeare wrote King of Lear while in quarantine. Newton laid the foundations for his laws of motion while in quarantine. People are making funny memes while in quarantine.",
  "translation": "莎士比亚在隔离区写了《李尔王》。 牛顿在检疫时为其运动定律奠定了基础。 人们在隔离时正在制作有趣的模因。"
}, {
  "tag": "P",
  "text": "What can you do? Changing the world of theatre forever or revolutionizing the world of physics — I expect that bar is too high. But you could enhance your skills in Data Science, and kickstart your career when this pandemic is over.",
  "translation": "你能做什么？ 永远改变剧院的世界或改变物理学的世界—我希望这个标准太高了。 但是，您可以提高自己在数据科学领域的技能，并在大流行结束后开始您的职业生涯。"
}, {
  "tag": "H2",
  "text": "How I went from zero coding skills to data scientist in 6 months",
  "translation": "我六个月内如何从零编码技能变成了数据科学家"
}, {
  "tag": "H3",
  "text": "The 4 tools I used to teach myself data science without spending a dollar",
  "translation": "我不用花一美元就能自学数据科学的4种工具"
}, {
  "tag": "P",
  "text": "This is no complete guide to all classes that are out there. If you do a simple Google search, you will see that there are more than you can take in a lifetime…",
  "translation": "这不是那里所有课程的完整指南。 如果您进行简单的Google搜索，就会发现一生中有比您更多的东西……"
}, {
  "tag": "P",
  "text": "Rather, this is a compendium of classes that I and others have found particularly useful. Which classes are right for you depends on your current level of skills in programming and statistics. Even though in practise the lines between programming and statistics are blurred, this guide is split between the two disciplines to make it easier to navigate.",
  "translation": "相反，这是我和其他人发现特别有用的课程纲要。 哪种课程适合您，取决于您目前在编程和统计方面的技能水平。 即使在实践中程序设计和统计之间的界线模糊不清，本指南还是在这两个学科之间进行划分，以使其易于浏览。"
}, {
  "tag": "P",
  "text": "In terms of programming, three languages are essential: Python, R and shell script. The latter is often underestimated by beginners. But if you’re a Data Scientist, it’s your bread and butter. You’ll also want to know a thing or two about Git and GitHub.",
  "translation": "在编程方面，三种语言必不可少：Python，R和Shell脚本。 初学者经常低估后者。 但是，如果您是一名数据科学家，那是您的面包和黄油。 您还需要了解有关Git和GitHub的一两件事。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*gSyiTHnPbyHrcd5_gwDpXA.jpeg?q=20",
  "caption": "It’s time to code. Photo by Markus Spiske on Unsplash",
  "type": "image",
  "file": "1!gSyiTHnPbyHrcd5_gwDpXA.jpeg"
}, {
  "tag": "P",
  "text": "Regarding Python and R, you might get away with knowing only one in depth. This depends on where you want to work later on.",
  "translation": "关于Python和R，您可能只了解其中一个而已。 这取决于您以后要在哪里工作。"
}, {
  "tag": "P",
  "text": "You’ll also need some knowledge about databases. (You want to be a Data Scientist, right?) The state of the art is SQL, so I suggest you get cracking on that before you start applying for jobs.",
  "translation": "您还需要一些有关数据库的知识。 （您想成为一名数据科学家，对吗？）最新的技术是SQL，所以我建议您在开始申请工作之前先加以了解。"
}, {
  "tag": "P",
  "text": "In terms of statistics, any general class on Data Science will do. Many of them also provide introductions to the most important languages and technical environments. But I still recommend taking a dedicated language class too. Because. Programming. Is. Important!",
  "translation": "在统计方面，任何数据科学普通课程都可以。 他们中的许多人还介绍了最重要的语言和技术环境。 但我仍然建议您也参加专门的语言课程。 因为。 编程。 是的。 重要！"
}, {
  "tag": "P",
  "text": "Since many of us face insecurities regarding our jobs and our budgets in these times, I’ve decided only to list free resources. After all, your discipline is a thousand times more important for your progress than the money you invest.",
  "translation": "由于我们很多人在这段时间都面临着工作和预算方面的不安全感，因此我决定只列出免费资源。 毕竟，纪律对于您的进步比投资的金钱重要一千倍。"
}, {
  "tag": "H1",
  "text": "Programming classes",
  "translation": "编程类"
}, {
  "tag": "P",
  "text": "Depending on your current skillset, you may need some or all of the classes listed here. I’ve deliberately only listed one, maximum two, classes per language to avoid confusion about which is the best for you.",
  "translation": "根据您当前的技能，您可能需要此处列出的部分或全部课程。 我特意只列出了每种语言的一门课程，最多两门课，以避免混淆哪种语言最适合您。"
}, {
  "tag": "P",
  "text": "If you’re an absolute beginner, I advise you to follow all of these before moving on with the Data Science classes listed below.",
  "translation": "如果您是绝对的初学者，我建议您在继续下面列出的数据科学课程之前，遵循所有这些步骤。"
}, {
  "tag": "H2",
  "text": "1. Python",
  "translation": "1. Python"
}, {
  "tag": "P",
  "text": "The materials at learnpython.org are a great starting point. It’s all interactive, and there’s no need to install anything — you can type your code directly in the browser.",
  "translation": "Learnpython.org上的材料是一个很好的起点。 全部都是交互式的，不需要安装任何东西-您可以直接在浏览器中键入代码。"
}, {
  "tag": "P",
  "text": "You’ll probably find that you’re able to play around with it after a few hours. Invest a few days, and you’ll be able to write your own basic programs.",
  "translation": "几个小时后，您可能会发现可以使用它了。 投资几天，您就可以编写自己的基本程序。"
}, {
  "tag": "P",
  "text": "Sooner or later, you’ll need to be able to install Python and related packages. If you feel ready for that, you can try Python’s official resources. However, I discourage you from doing so if you have no prior coding experience since that can be quite intimidating.",
  "translation": "迟早，您将需要能够安装Python和相关软件包。 如果您愿意，可以尝试使用Python的官方资源。 但是，如果您以前没有编码经验，我会劝阻您不要这样做，因为这可能会令人生畏。"
}, {
  "tag": "P",
  "text": "If you have some money to spend, you can visit the Python classes by DataCamp. You get access to most courses for $25 per month, and they’re also code-in-browser classes. For most purposes, however, the free resources from Python and learnpython.org will be completely sufficient.",
  "translation": "如果您有花钱，可以访问DataCamp的Python类。 您可以每月25美元的价格访问大多数课程，它们也是浏览器中的代码课程。 但是，对于大多数目的而言，来自Python和Learnpython.org的免费资源将完全足够。"
}, {
  "tag": "H2",
  "text": "2. R",
  "translation": "2. R"
}, {
  "tag": "P",
  "text": "The edX course by Harvard University will give you all you need to get started with R. The class is 8 weeks long, but you’ll only need to put in 1–2 hours a week. So this should work even if you have a busy schedule.",
  "translation": "哈佛大学的edX课程将为您提供R入门所需的一切。课程为时8周，但您每周只需投入1-2小时。 因此，即使您的日程安排很忙，此操作也应该有效。"
}, {
  "tag": "P",
  "text": "If you want to put in a little more effort and get deeper knowledge, there is also the coursera class by Johns Hopkins University. It’s four weeks long, with 25 hours of effort in the first week and 10–12 hours a week after that. This course also covers the installation and gives you some background knowledge.",
  "translation": "如果您想付出更多的努力并获得更多的知识，约翰霍普金斯大学还开设了课程班。 这是四周的时间，第一周需要25个小时的努力，此后每周10到12个小时。 本课程还介绍了安装过程，并为您提供了一些背景知识。"
}, {
  "tag": "H2",
  "text": "Getting started with R Programming",
  "translation": "R编程入门"
}, {
  "tag": "H3",
  "text": "An end to end Data Analysis using R, the second most requested programming language in Data Science.",
  "translation": "使用R（数据科学中需求第二大的编程语言）进行端到端数据分析。"
}, {
  "tag": "H2",
  "text": "3. SQL",
  "translation": "3. SQL"
}, {
  "tag": "P",
  "text": "While datasets are quite manageable in Python, SQL is the way to go with large volumes. The tutorial by w3schools.com covers pretty much all the basics.",
  "translation": "尽管在Python中数据集非常易于管理，但是SQL是处理大量数据的方法。 w3schools.com的教程涵盖了几乎所有的基础知识。"
}, {
  "tag": "P",
  "text": "With lots of code-in-browser examples, this tutorial is very suitable for beginners. It should take about 10–15 hours to complete.",
  "translation": "本教程提供了许多浏览器内代码示例，非常适合初学者。 大约需要10到15个小时才能完成。"
}, {
  "tag": "P",
  "text": "If you’re more of a video course type, you could also try the class by Khan Academy. There are more challenging text-in-browser examples in here, but the overall course time will be shorter — it should take you 5–10 hours to complete that one.",
  "translation": "如果您更喜欢视频课程，也可以尝试可汗学院的课程。 这里有更多具有挑战性的“浏览器中文本”示例，但总的课程时间将缩短-完成该课程所需的时间为5-10小时。"
}, {
  "tag": "H2",
  "text": "4. Shell script",
  "translation": "4. Shell脚本"
}, {
  "tag": "P",
  "text": "A great way to get started is the Learn Code The Hard Way Book. It’s very systematic and without any fancy UI. But that’s exactly what makes it so good — later on, you’ll also sit at a command line without the usual graphic trills.",
  "translation": "学习代码The Hard Way Book是一个很好的入门方法。 它非常系统化，没有任何精美的用户界面。 但这正是使它变得如此出色的原因-稍后，您还将坐在命令行中，而没有通常的图形琐事。"
}, {
  "tag": "P",
  "text": "Following this class requires some discipline. But it’s worth it. Completing it should take 5–10 hours, depending on how deep you dive.",
  "translation": "参加本课程需要纪律处分。 但这是值得的。 完成此过程需要5到10个小时，具体取决于您的潜水深度。"
}, {
  "tag": "H2",
  "text": "5. GitHub",
  "translation": "5. GitHub"
}, {
  "tag": "P",
  "text": "If you’ve never used GitHub before, I recommend reading and following Anne Bonner’s guide. It’s here:",
  "translation": "如果您以前从未使用过GitHub，建议阅读并遵循Anne Bonner的指南。 它在这里："
}, {
  "tag": "H2",
  "text": "Getting started with Git and GitHub: the complete beginner’s guide",
  "translation": "Git和GitHub入门：完整的初学者指南"
}, {
  "tag": "H3",
  "text": "Git and GitHub basics for the curious and completely confused (plus the easiest way to contribute to your first open…",
  "translation": "好奇和完全困惑的Git和GitHub基础（以及为首次公开募捐做出贡献的最简单方法…"
}, {
  "tag": "P",
  "text": "It’s an 18-minute read, but I suggest you invest at least a couple of hours to get started. It is a good idea to get everything up and running as you read the guide since you’ll be needing that stuff over and over again.",
  "translation": "这是一本长达18分钟的阅读书，但是我建议您至少花几个小时才能入门。 在阅读指南时，最好使所有功能都正常运行，因为您将一遍又一遍地需要这些东西。"
}, {
  "tag": "P",
  "text": "If you already know a thing or two, then GitHub’s guides can help you fill the gaps.",
  "translation": "如果您已经知道一两件事，那么GitHub的指南可以帮助您填补空白。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*dkaaQANPIRundBMKN-6c4Q.jpeg?q=20",
  "caption": "Those statistics don’t master themselves. Photo by Markus Spiske on Unsplash",
  "type": "image",
  "file": "1!dkaaQANPIRundBMKN-6c4Q.jpeg"
}, {
  "tag": "H1",
  "text": "Data Science & statistics classes",
  "translation": "数据科学与统计课"
}, {
  "tag": "P",
  "text": "If you have acquired some skills in programming, you can use these classes to deepen your knowledge in statistics. Taking one or two classes will be enough — what is the best fit for you will depend on your time budget and what language you prefer.",
  "translation": "如果您掌握了一些编程技能，则可以使用这些课程来加深对统计的了解。 上一两个课就足够了-最适合您的时间取决于您的时间预算和您喜欢的语言。"
}, {
  "tag": "H2",
  "text": "6. Johns Hopkins University / coursera: Data Science specialization",
  "translation": "6.约翰霍普金斯大学/课程：数据科学专业"
}, {
  "tag": "P",
  "text": "time: ~200 hours (or 6 hours weekly for 8 months), self-pacedlanguage: R, but Python is a prerequisite",
  "translation": "时间：〜200小时（或每周6小时，共8个月），自定步调语言：R，但是Python是先决条件"
}, {
  "tag": "P",
  "text": "This class is one of the highest-recommended for aspiring Data Scientists. It’s comprised of 10 sub-courses which you can mix and match as you like. But if you want to earn a certificate to show your future employer, you’ll have to do the whole thing.",
  "translation": "该课程是有抱负的数据科学家推荐的最高水平之一。 它由10个子课程组成，您可以随意混合和匹配。 但是，如果您想获得证书来向未来的雇主展示，则必须做全部。"
}, {
  "tag": "H2",
  "text": "7. Harvard School of Engineering: CS109 course material",
  "translation": "7.哈佛工程学院：CS109课程材料"
}, {
  "tag": "P",
  "text": "time: ~100 hours (or 8 hours weekly for 13 weeks), self-pacedlanguage: Python",
  "translation": "时间：〜100小时（或每周8小时，共13周），自定进度语言：Python"
}, {
  "tag": "P",
  "text": "This is an actual class as taught at the Harvard John A. Paulson School of Engineering and Applied Sciences. Even though it’s not an online class in like those on coursera, edX and the likes, the wealth of material is a joy to look through.",
  "translation": "这是哈佛约翰·保尔森工程与应用科学学院教授的实际课程。 尽管它不是Coursera，edX之类的在线课程，但丰富的材料仍然是一种浏览的乐趣。"
}, {
  "tag": "H2",
  "text": "8. Harvard University / edX: Statistics and R",
  "translation": "8.哈佛大学/ edX：统计与研究"
}, {
  "tag": "P",
  "text": "time: 8-16 hours (or 2–4 hours weekly for 4 weeks), self-pacedlanguage: R, basic programming is a prerequisite",
  "translation": "时间：8-16小时（或每周2–4小时，共4周），自定进度语言：R，必须具备基本编程知识"
}, {
  "tag": "P",
  "text": "Given the small time scope, this class covers the very basics of Data Science. It focuses more on data analysis and visualization. This is an option if you’re short in time but still want to learn something.",
  "translation": "由于时间范围较小，因此该课程涵盖了数据科学的基础知识。 它更侧重于数据分析和可视化。 如果您时间短但仍想学习一些东西，则可以使用此选项。"
}, {
  "tag": "H2",
  "text": "9. udacity: Introduction to Data Science",
  "translation": "9. udacity：数据科学导论"
}, {
  "tag": "P",
  "text": "time: ~100 hours (or 10 hours weekly for 2 months), self-pacedlanguage: Python",
  "translation": "时间：〜100小时（或每周10小时，为期2个月），自定进度语言：Python"
}, {
  "tag": "P",
  "text": "This class covers everything from data acquisition, analysis, and visualization. The number of hours and the interactive format might be ideal for those who are stuck at home at the moment. If you work at it at a higher intensity, you could be done with it within a few weeks!",
  "translation": "该课程涵盖了从数据采集，分析和可视化的所有内容。 小时数和交互式格式对于那些现在呆在家里的人来说可能是理想的选择。 如果您以更高的强度进行工作，则可以在几周内完成！"
}, {
  "tag": "H2",
  "text": "10. University of Texas / edX: Foundations of Data Analysis",
  "translation": "10.德克萨斯大学/ edX：数据分析基础"
}, {
  "tag": "P",
  "text": "time: 18–36 hours (or 3–6 hours weekly for 6 weeks), self-pacedlanguage: R, basic programming is a prerequisite",
  "translation": "时间：18-36小时（或每周3-6小时，共6周），自定进度语言：R，基本编程是前提条件"
}, {
  "tag": "P",
  "text": "This course markets itself as a typical undergraduate statistics course with an added twist of modeling. However, since the time investment is pretty low, I would argue that it is more an introduction to statistics and modeling.",
  "translation": "本课程将自己作为典型的本科统计学课程，并附加了建模方面的内容。 但是，由于时间投入非常少，因此我认为它更多地是对统计和建模的介绍。"
}, {
  "tag": "H2",
  "text": "11. University of Michigan / coursera: Applied Data Science",
  "translation": "11.密歇根大学/ Coursera：应用数据科学"
}, {
  "tag": "P",
  "text": "time: ~120 hours (or 8 hours weekly for 4 months), self-pacedlanguage: Python",
  "translation": "时间：〜120小时（或每周8小时，共4个月），自定进度语言：Python"
}, {
  "tag": "P",
  "text": "This course is similar to number 6 in its makeup, but it’s a lot more hands-on. It’s comprised of 5 sub-courses that you can mix and match as you wish. This might be especially useful if you already know what industry you would like to work in. For example, two exciting parts of the course are machine learning and social network analysis.",
  "translation": "这门课程的妆容与第六名相似，但实际操作要多得多。 它由5个子课程组成，您可以根据需要混合和匹配。 如果您已经知道要从事的行业，这可能特别有用。例如，本课程的两个令人兴奋的部分是机器学习和社交网络分析。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*NUtj7tD2yAz3sSvnTwYvwg.jpeg?q=20",
  "caption": "Time to learn something new. Photo by Annie Spratt on Unsplash",
  "type": "image",
  "file": "1!NUtj7tD2yAz3sSvnTwYvwg.jpeg"
}, {
  "tag": "H1",
  "text": "Final note: Use your domain knowledge. And your network",
  "translation": "最后说明：使用您的领域知识。 和你的网络"
}, {
  "tag": "P",
  "text": "All these courses are available for everyone with an internet connection. Therefore, while they might give you good foundations to build upon, they will not be the edge that separates you from other candidates.",
  "translation": "所有具有互联网连接的人都可以使用这些课程。 因此，尽管它们可以为您提供良好的基础，但它们不会成为将您与其他候选人分开的优势。"
}, {
  "tag": "P",
  "text": "Think about what makes you as a Data Scientist unique? Which domains have you worked on before — health, mathematics, biology, chemistry, physics or something completely different?",
  "translation": "考虑一下什么使您成为数据科学家的独特之处？ 您之前从事过哪些领域的研究-健康，数学，生物学，化学，物理学或完全不同的领域？"
}, {
  "tag": "H2",
  "text": "9 Reasons why you’ll never become a Data Scientist",
  "translation": "您永远不会成为数据科学家的9个理由"
}, {
  "tag": "H3",
  "text": "You need to change your mindset",
  "translation": "你需要改变心态"
}, {
  "tag": "P",
  "text": "And who in your network could give you a good introduction? Who knows someone who knows somebody else in Data Science? Let your connections play.",
  "translation": "您网络中的谁可以给您很好的介绍？ 谁认识一个认识数据科学的人？ 让您的联系开始。"
}, {
  "tag": "P",
  "text": "And finally, take advice. Don’t take it from me, take it from other people who have made the transition to a Data Scientist. Reading stories in Towards Data Science is a great starting point.",
  "translation": "最后，征求意见。 不要从我那儿拿走它，而是从那些已经过渡到数据科学家的人那里拿走它。 阅读《走向数据科学》中的故事是一个很好的起点。"
}, {
  "tag": "P",
  "text": "But your goal should also be to get in direct contact and set up informal interviews with the people you look up to. This way, you can learn from their experiences first-hand.",
  "translation": "但是，您的目标还应该是与您所仰望的人建立直接联系并进行非正式访谈。 这样，您可以直接从他们的经验中学习。"
}, {
  "tag": "P",
  "text": "For those of you who are in quarantine, I hope this guide helps to keep you sane and informed. Quarantined or not, I hope we all can use these times to set up a brighter future. Learning something new is only the beginning.",
  "translation": "对于那些正在隔离中的人，我希望本指南有助于您保持理智和了解情况。 是否隔离，我希望我们所有人都可以利用这些时间来建立更美好的未来。 学习新事物仅仅是开始。"
}, {
  "tag": "H2",
  "text": "The Ultimate Guide to Getting Started in Data Science",
  "translation": "数据科学入门终极指南"
}, {
  "tag": "H3",
  "text": "How I started getting data science job offers in under 6 months",
  "translation": "我是如何在不到6个月的时间内开始获得数据科学工作机会的"
}, {
  "tag": "PRE",
  "text": "(本文翻译自Rhea Moutafis的文章《11 best Data Science classes if you’re locked home because of coronavirus》，参考：https://towardsdatascience.com/11-best-data-science-classes-if-youre-locked-home-because-of-coronavirus-ca7d2d74a454)",
  "translation": "（本文翻译自Rhea Moutafis的文章《如果因冠状病毒而被锁在家中的11个最佳数据科学课》，参考：https：//towardsdatascience.com/11-best-data-science-classes-if-youre-locked 家庭，因为冠状病毒ca7d2d74a454）"
}]