[{
  "tag": "H1",
  "text": "11. Google Fonts",
  "translation": "11. Google字体"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*0_PuYByZCIFxjJQAfP9goA.jpeg?q=20",
  "type": "image",
  "file": "1!0_PuYByZCIFxjJQAfP9goA.jpeg"
}, {
  "tag": "P",
  "text": "This is also one of those nonnegotiable tools for all designers and developers, and Google Fonts is probably the best in this field.",
  "translation": "这也是所有设计师和开发人员不可转让的工具之一，而Google字体可能是该领域中最好的工具。"
}, {
  "tag": "P",
  "text": "Bookmark this, and put this on the top of your top list. This is a must, and the best part is it’s free and so easy to use.",
  "translation": "将此添加为书签，并将其放在顶部列表的顶部。 这是必须的，最好的部分是它免费且易于使用。"
}, {
  "tag": "H1",
  "text": "10. Adobe Color",
  "translation": "10. Adobe色彩"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*-w3v8DIL_0Reg9HbKBUNfw.jpeg?q=20",
  "type": "image",
  "file": "1!-w3v8DIL_0Reg9HbKBUNfw.jpeg"
}, {
  "tag": "P",
  "text": "This is a nonnegotiable tool for every designer and developer. This is highly recommended whenever you want to explore or test color combinations that you’ll need for your design proposal or project.",
  "translation": "对于每个设计人员和开发人员来说，这都是不可转让的工具。 强烈建议您在要探索或测试设计提案或项目所需的颜色组合时使用。"
}, {
  "tag": "P",
  "text": "There are thousands of color combinations to choose from, and there are also several recommendations you can easily use for Photoshop, Illustrator, etc.",
  "translation": "有成千上万种颜色组合可供选择，还有一些建议可以轻松用于Photoshop，Illustrator等。"
}, {
  "tag": "H1",
  "text": "9. Five Second Test",
  "translation": "9.五秒钟测试"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*z8_nVIzsoS3u2JwRoYMEFA.png?q=20",
  "type": "image",
  "file": "1!z8_nVIzsoS3u2JwRoYMEFA.png"
}, {
  "tag": "P",
  "text": "Once your project is ready to go, make sure to keep in mind the proven survey result that most users expect your website to load in about two seconds, and if it takes longer than that magic number, there’s a high probability the user or visitor will exit or close your website.",
  "translation": "一旦您的项目准备就绪，请确保牢记大多数用户希望您的网站在大约两秒钟内加载的可靠调查结果，并且如果花费的时间比该魔幻数字长，则用户或访客很有可能会 退出或关闭您的网站。"
}, {
  "tag": "P",
  "text": "Five Second Test is a good solution to this problem — all you need to do is just share your home page, images, landing pages, and all other marketing materials to them, and they’ll then review all of your website assets to determine if there are any that need to improve or even be removed.",
  "translation": "五秒测试是解决此问题的好方法-您所要做的只是向他们共享主页，图像，登录页面和所有其他营销材料，然后他们将查看您的所有网站资产，以确定是否 有任何需要改进甚至删除的地方。"
}, {
  "tag": "H1",
  "text": "8. Remove.bg",
  "translation": "8. Remove.bg"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*rWyEzAAKj6LS-uGJ3wrTog.jpeg?q=20",
  "type": "image",
  "file": "1!rWyEzAAKj6LS-uGJ3wrTog.jpeg"
}, {
  "tag": "P",
  "text": "This probably solves a very simple problem, but it’s one of the most critical ones. Because of Remove.bg, you’ll no longer need to be an expert in Photoshop to remove backgrounds from your photos. You can just upload any picture to Remove.bg, and it’ll take care of the rest.",
  "translation": "这可能解决了一个非常简单的问题，但这是最关键的问题之一。 由于有了Remove.bg，您不再需要成为Photoshop的专家即可从照片中删除背景。 您可以将任何图片上传到Remove.bg，其余的工作都将由它负责。"
}, {
  "tag": "P",
  "text": "It’s free, and there’s no signup required. It’ll do all the work that’s needed.",
  "translation": "它是免费的，不需要注册。 它将完成所有需要的工作。"
}, {
  "tag": "H1",
  "text": "7. Dribble",
  "translation": "7.运球"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*7ZWF8v2HUvOWLsXmzOaSbg.png?q=20",
  "type": "image",
  "file": "1!7ZWF8v2HUvOWLsXmzOaSbg.png"
}, {
  "tag": "P",
  "text": "This website is a wide source of inspiration. You have to bookmark this — everything in there is magic.",
  "translation": "该网站提供了广泛的灵感。 您必须为此添加书签-里面的所有东西都是魔术。"
}, {
  "tag": "P",
  "text": "“It’s really hard to design products by focus groups. A lot of times, people don’t know what they want until you show it to them.”",
  "translation": "“要由焦点小组设计产品确实非常困难。 很多时候，人们不知道自己想要什么，除非您向他们展示。"
}, {
  "tag": "P",
  "text": "— Steve Jobs",
  "translation": "—史蒂夫·乔布斯"
}, {
  "tag": "H1",
  "text": "6. Bootstrap",
  "translation": "6.引导程序"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*aPCxWOripRVKgx7C2PZUNA.jpeg?q=20",
  "type": "image",
  "file": "1!aPCxWOripRVKgx7C2PZUNA.jpeg"
}, {
  "tag": "P",
  "text": "Bootstrap is very popular with all the front-end developers. It helps a lot in making your websites responsive and mobile-friendly, as they’re promoting the mobile-first web design approach.",
  "translation": "Bootstrap在所有前端开发人员中都很受欢迎。 由于网站正在推广移动优先的网页设计方法，因此有助于使您的网站具有响应性和移动友好性。"
}, {
  "tag": "P",
  "text": "Bootstrap was designed by the developers and engineers behind Twitter. The platform itself is downloadable — either precompiled or via the source code.",
  "translation": "Bootstrap由Twitter背后的开发人员和工程师设计。 该平台本身是可下载的-可以预编译或通过源代码下载。"
}, {
  "tag": "P",
  "text": "It’s fully functional and very easy to use. One of its main features is the ability to easily design a grid of fully functional HTML and CSS elements. You can just call these by name to use the component. They’re every front-end developer’s favorite — it saves so much time in development and provides very understandable code.",
  "translation": "它功能齐全且易于使用。 它的主要功能之一是能够轻松设计功能齐全的HTML和CSS元素的网格。 您只需按名称调用它们即可使用该组件。 它们是每个前端开发人员的最爱-这样可以节省大量开发时间，并提供易于理解的代码。"
}, {
  "tag": "H1",
  "text": "5. Canva",
  "translation": "5. Canva"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*wJUUybi6rNyN12HTKet6Fg.jpeg?q=20",
  "type": "image",
  "file": "1!wJUUybi6rNyN12HTKet6Fg.jpeg"
}, {
  "tag": "P",
  "text": "Canva is getting more popular these days. You can create your digital designs for free, it’s very easy to use, and there are thousands of free resources to choose from. They also provide a wide variety of samples you can easily use and just replace the text. You can also upload your images and save them there for future use.",
  "translation": "如今，Canva越来越受欢迎。 您可以免费创建数字设计，它非常易于使用，并且有数千种免费资源可供选择。 它们还提供了各种示例，您可以轻松使用它们，而只需替换文本即可。 您也可以上传图像并将其保存在那里以备将来使用。"
}, {
  "tag": "P",
  "text": "They also have millions of photos, logos, and icons that you can buy — starting at $1 each — or you can just use the 400,000+ free photos, illustrations, and templates. I’ve been using Canva for more than two years, and I can’t believe they offer such a wide variety of their services for free. It still amazes me.",
  "translation": "他们还拥有数百万张照片，徽标和图标，您可以购买-每张起价为1美元-或者您可以只使用400,000多张免费照片，插图和模板。 我使用Canva已有两年多了，我无法相信他们免费提供了如此广泛的服务。 它仍然令我惊讶。"
}, {
  "tag": "H1",
  "text": "4. InVision",
  "translation": "4.视觉"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*14M0wskwnh4_MvpQYYQI-g.png?q=20",
  "type": "image",
  "file": "1!14M0wskwnh4_MvpQYYQI-g.png"
}, {
  "tag": "P",
  "text": "I highly recommend InVision — I’ve been using InVision for a couple of years already. I just find it so easy to use, and it’s dark theme attracted me to it.",
  "translation": "我强烈推荐InVision-我已经使用InVision两年了。 我只是觉得它很容易使用，而且它的黑暗主题吸引了我。"
}, {
  "tag": "P",
  "text": "I also use InVision for my UI/UX creation projects and mobile-app presentations. I’m just comfortable with this tool, and I hope you’ll love it too.",
  "translation": "我还在UI / UX创建项目和移动应用演示中使用InVision。 我对这个工具很满意，希望您也喜欢。"
}, {
  "tag": "P",
  "text": "And the best part is it’s free.",
  "translation": "最好的部分是免费的。"
}, {
  "tag": "H1",
  "text": "3. Balsamiq",
  "translation": "3. Balsamiq"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*IliDnOQ6kkfLULf6oDX-Sw.png?q=20",
  "type": "image",
  "file": "1!IliDnOQ6kkfLULf6oDX-Sw.png"
}, {
  "tag": "P",
  "text": "When it comes to easy wireframing, Balsamiq is one of the most favored tools among designers. It’s very easy to use, direct, and it’s also available for your desktop and on cloud apps. It’s also nice when working on a team — you can easily create and invite other team members for collaboration.",
  "translation": "当谈到简单的线框图时，Balsamiq是设计师中最受欢迎的工具之一。 它非常易于使用，直接操作，也可用于您的桌面和云应用。 在团队中工作也很好-您可以轻松创建并邀请其他团队成员进行协作。"
}, {
  "tag": "P",
  "text": "They have wide array of available features to choose, from mobile design to website design. You can just easily drag and drop several UI elements into your project wireframe. Once your prototype project is done, you can easily print it out or run a test before sending it to your front-end developers.",
  "translation": "从移动设计到网站设计，它们具有多种可用功能供您选择。 您可以轻松地将几个UI元素拖放到项目线框中。 原型项目完成后，您可以轻松地将其打印或运行测试，然后再将其发送给前端开发人员。"
}, {
  "tag": "P",
  "text": "They offer a one-month free trial.",
  "translation": "他们提供一个月的免费试用。"
}, {
  "tag": "H1",
  "text": "2. Adobe XD",
  "translation": "2. Adobe XD"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*hM_wVJ-x8KP1tD7-O973Rw.png?q=20",
  "type": "image",
  "file": "1!hM_wVJ-x8KP1tD7-O973Rw.png"
}, {
  "tag": "P",
  "text": "Adobe XD is a vector-based, so for constant designing and prototyping, it’s perfect for UI designers and UX designers, including front-end developers. I’m personally using Adobe XD for designing and prototyping my presentations. This is a must-have tool for every designer — as well as all the aspiring UI/UX designer.",
  "translation": "Adobe XD是基于矢量的，因此，对于持续的设计和原型制作，它非常适合UI设计人员和UX设计人员，包括前端开发人员。 我个人使用Adobe XD来设计和制作演示文稿的原型。 这是每个设计师以及所有有抱负的UI / UX设计师必备的工具。"
}, {
  "tag": "P",
  "text": "It’s very easy to use, and the best part is I got it for free.",
  "translation": "它非常易于使用，最好的部分是我免费获得了它。"
}, {
  "tag": "H1",
  "text": "1. Sketch",
  "translation": "1.素描"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*y2DbXabIGKWppcNUmsJ5Ig.png?q=20",
  "type": "image",
  "file": "1!y2DbXabIGKWppcNUmsJ5Ig.png"
}, {
  "tag": "P",
  "text": "I haven’t used Sketch because even though I partly do the designing process before coding, I’m not quite into all of the designing details. But I know you all have heard of Sketch, and I know you’ll all agree that this is one of the most popular tools.",
  "translation": "我之所以没有使用Sketch，是因为即使我在编码之前进行了部分设计，但我并没有完全了解所有设计细节。 但我知道大家都听说过Sketch，并且我都同意这是最受欢迎的工具之一。"
}, {
  "tag": "P",
  "text": "Based on the feedback on the internet, Sketch is very useful for wireframing and prototyping, and I’m certain most professional UI/UX designers will highly recommend using this tool, especially for beginners.",
  "translation": "根据互联网上的反馈，Sketch对于线框图和原型制作非常有用，我相信大多数专业的UI / UX设计师都会强烈建议使用此工具，特别是对于初学者。"
}, {
  "tag": "H1",
  "text": "11 Must-Have Web Design Tools and Resources for Developers",
  "translation": "开发人员必须具备的11种Web设计工具和资源"
}, {
  "tag": "H2",
  "text": "What should be on your front-end cheat sheet",
  "translation": "前端备忘单上应该包含什么"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*fhgei1picmTQj-TIOASTWg.jpeg?q=20",
  "caption": "Photo by Markus Spiske on Unsplash",
  "type": "image",
  "file": "1!fhgei1picmTQj-TIOASTWg.jpeg"
}, {
  "tag": "P",
  "text": "“Focus and Simplicity. Simple can be harder than complex: You have to work hard to get your thinking clean to make it simple. But it’s worth it in the end because once you get there, you can move mountains.”",
  "translation": "“专注和简单。 简单可能比复杂更难：您必须努力工作以使您的想法变得简洁。 但最终还是值得的，因为一旦到达那里，您就可以搬山。”"
}, {
  "tag": "P",
  "text": "— Steve Jobs",
  "translation": "—史蒂夫·乔布斯"
}, {
  "tag": "P",
  "text": "Most of the tools and the resources that’ll be mentioned are also the tools I’ve gathered that have been recommended by senior developers and some that I’m still using today.",
  "translation": "我将收集的大多数工具和资源，也是我收集的，高级开发人员推荐的工具以及我今天仍在使用的工具。"
}, {
  "tag": "P",
  "text": "If you haven’t read any of my previous articles, I’m a self-taught web and mobile developer — and have been for four years now. I got a degree in business information management. The first time I was exposed to technology was through using a database for business, MySQL and Visual Basic, along with accounting subjects and investment. I hadn’t thought of pursuing the technology side of my degree back then, but three years later, I found a friend who was so interested in web development. He inspired me to take on the challenge by enrolling in a study-now-pay-later bootcamp for 4-6 months because we hated our jobs at that time.",
  "translation": "如果您还没有阅读我以前的文章，那么我是一位自学成才的网络和移动开发人员-已有四年了。 我获得了商务信息管理学位。 我第一次接触技术是通过使用用于业务，MySQL和Visual Basic的数据库，以及会计科目和投资。 那时我还没想到要攻读学位的技术方面，但是三年后，我找到了一个对网络开发非常感兴趣的朋友。 他鼓舞了我，参加了一个4-6个月的现在就读的新兵训练营，以应对挑战，因为当时我们讨厌工作。"
}, {
  "tag": "P",
  "text": "I got interested because of its potential, and the more I did my research the more I got so excited; however, due to my unlikely circumstances, I couldn’t just leave my job and go back to studying. I was supporting myself, so I needed a job. I wasn’t financially ready at that time, but I couldn’t stop thinking about it.",
  "translation": "由于它的潜力，我变得很感兴趣，而我做的研究越多，我就越兴奋。 但是，由于我的处境不太可能，我不能只是辞掉工作重返学习。 我当时正在养活自己，所以我需要工作。 当时我还没有做好财务准备，但是我一直想着。"
}, {
  "tag": "P",
  "text": "Fast forward: I pursued learning web development. I created a plan, a one-year plan, and I made a promise that I’d work as hard as I could. I decided I’d continue at it for at least a year — I’ve wasted several years of my life living the same day every day in a cubicle with no choice but to follow my boss and the HR department. I got sick of the system that was driving me, that was fueling me, and that was making me so mad that I knew I needed to make something new work or I’d never be able to change my life.",
  "translation": "快进：我追求学习网络开发。 我制定了一个计划，一个为期一年的计划，并承诺将尽我所能。 我决定至少继续工作一年–我浪费了数年的生活，每天都住在隔间里，只能跟随老板和人事部门。 我讨厌那种驱使我前进，使我加油的系统，这让我非常生气，以至于我知道我需要做一些新的工作，否则我将永远无法改变自己的生活。"
}, {
  "tag": "P",
  "text": "So I was work 9-5 at my nontech job and pursuing studying on my own at a coffees hop near my office, three hours before my shift and three hours after my shift. I studies 10 hours/day on weekends and holidays. I avoided a lot of parties, friends, gatherings, travels, and expenses. I promised myself one year — if it still didn’t work no matter how I tried, then it’d be OK. I did my best — no regrets.",
  "translation": "因此，我在非技术性工作中的工作时间为9-5，并且在我上班前三个小时和下班后三个小时在我办公室附近的咖啡馆喝咖啡。 我在周末和节假日每天学习10个小时。 我避免了很多聚会，朋友，聚会，旅行和开销。 我向自己保证了一年-如果无论我如何尝试仍然无法正常工作，那就可以了。 我已经尽力了-不后悔。"
}, {
  "tag": "P",
  "text": "If you have the courage to do all the work that needs to be done without any excuses and without complaints — if you just strive — eventually luck will find its way to you. In my case, I got my first web-developer job after six months. The day I signed my new employment contract with the job title WEB DEVELOPER on it in bold caps lock was also the day I sent my resignation letter. It was a good day.",
  "translation": "如果您有勇气去做所有需要做的工作而没有任何借口和抱怨，而您只是在努力，最终运气就会找到您。 就我而言，六个月后我获得了第一份网络开发人员的工作。 我以粗体大写字母签上了名为WEB DEVELOPER的新雇佣合同的那天，也是我发送辞职信的那天。 这是一个美好的一天。"
}, {
  "tag": "P",
  "text": "So going back to learning front-end development: I couldn’t stretch this enough. I’ve mentioned this several times in my previous writings — the importance of building a good foundation. As a front-end developer or as an inspiring front-end developer, it’s important for you to know these basic tools that’ll help you make your designing faster and better — and will boost up your creativity.",
  "translation": "因此，请回到学习前端开发的角度：我做得还不够。 我在以前的著作中已经多次提到这一点-建立良好基础的重要性。 作为前端开发人员或鼓舞人心的前端开发人员，重要的是，您必须了解这些基本工具，这些工具将帮助您更快更好地进行设计，并提高创造力。"
}, {
  "tag": "P",
  "text": "There are several stages when it comes to making an idea into a reality. Just like building an application, it’ll start with an idea. It’ll be formed into words and will first exist in writings and drafts. Soon enough, it’ll have its form, shapes, and then functionalities. Then, it’ll go into development, into branding, into marketing, etc.",
  "translation": "将想法变为现实需要几个阶段。 就像构建应用程序一样，它将从一个想法开始。 它会形成文字，并首先存在于文字和草稿中。 很快，它将具有其形式，形状和功能。 然后，它将进入开发，品牌推广，市场营销等阶段。"
}, {
  "tag": "P",
  "text": "Bookmark them, download them, use them as your reference. Trust me: Even if you’ve been working for four years or ten years, eventually you’ll forget about them and try to find them again. Now here it is — I just made you a list.",
  "translation": "将它们添加为书签，下载并用作参考。 相信我：即使您已经工作了四年或十年，最终您都会忘记它们，然后再次尝试寻找它们。 现在在这里-我刚刚给您列出了一个清单。"
}, {
  "tag": "PRE",
  "text": "(本文翻译自Ann Adaya的文章《11 Must-Have Web Design Tools and Resources for Developers》，参考：https://medium.com/better-programming/every-front-end-developers-web-designing-cheatsheet-9851771eb5b6)",
  "translation": "（本文翻译自Ann Adaya的文章，《 11个开发人员必须具备的Web设计工具和资源》，参考：https：//medium.com/better-programming/every-front-end-developers-web-designing-cheatsheet- 9851771eb5b6）"
}]